#!/usr/bin/env python

# Mikhail (myke) Kolodin, 2025
# chain-num-1str.py 2025-01-262025-01-27 2.1

# ~ Цепочки чисел - 1
# ~ -----------------------------------------------

# ~ Даны несколько чисел (это список строк).
# ~ Верно ли, что они записаны цепочкой вида  13, 356, 671, 1, 12 ?
# т.е. последняя цирфа очередного равна первой цифре следующего.
# это версия просто на строках

samples = """
13 356 671 1 12
122345 67890 6543 7654 9876
12 23 34 45 56 67 78 89 90
123 345 567 789 901 12
1234 4567 7890
1 2 3 4 5 6 7 8 9 0
"""

# -------------------------------------
# решаем
# вер. 1, просто список

def solve1(s):
    """решаем 1 пример"""

    numbers = s.strip().split()

    for i in range(len(numbers) - 1):
        if numbers[i][-1] != numbers[i+1][0]:
            return False

    return True
    
# -------------------------------------
# решаем
# вер. 2, итераторы

from itertools import pairwise

def solve2(s):
    """решаем 1 пример"""

    # ~ print(f"пример: {s}")

    # ~ for s1, s2 in pairwise(s.split()):
        # ~ print(f"пары {s1} и {s2}: {s1[-1] == s2[0]}")

    return "да" if all( s1[-1] == s2[0] for s1, s2 in pairwise(s.split())) else "нет"

# -------------------------------------
# решаем всё

solve = solve1

def main():
    """решаем все примеры"""
    
    for sample in samples.strip().splitlines():
        print(sample, "=>", solve(sample))

main()

# ---------------------------------------------------
# результат:

# ~ 13 356 671 1 12 => да
# ~ 122345 67890 6543 7654 9876 => нет
# ~ 12 23 34 45 56 67 78 89 90 => да
# ~ 123 345 567 789 901 12 => да
# ~ 1234 4567 7890 => да
# ~ 1 2 3 4 5 6 7 8 9 0 => нет

# -------------------------- конец --------------------
