#!/usr/bin/env python
# Mikhail (myke) Kolodin
# 2025-03-27 2025-03-27 1.0
# raven-betaki.py

# ~ https://www.youtube.com/watch?v=FmjxGRCrgj4
# ~ Александр Иванов.Черный Ворон. Стихи Н. Глазкова

text = """Мрачной полночью бессонной, беспредельно утомленный.
В книги древние вникал я и, стремясь постичь их суть
Над старинным странным томом задремал, и вдруг сквозь дрему
Стук нежданный в двери дома мне почудился чуть-чуть,
"Это кто-то, - прошептал я, - хочет в гости заглянуть,
Просто в гости кто-нибудь!"

Так отчетливо я помню - был декабрь, глухой и темный,
И камин не смел в лицо мне алым отсветом сверкнуть,
Я с тревогой ждал рассвета: в книгах не было ответа,
Как на свете жить без света той, кого уж не вернуть,
Без Линор, чье имя мог бы только ангел мне шепнуть
В небесах когда-нибудь.

Шелковое колыханье, шторы пурпурной шуршанье
Страх внушало, сердце сжало, и, чтоб страх с души стряхнуть,
Стук в груди едва умеря, повторял я, сам не веря:
Кто-то там стучится в двери, хочет в гости заглянуть,
Поздно так стучится в двери, видно, хочет заглянуть
Просто в гости кто-нибудь.

Молча вслушавшись в молчанье, я сказал без колебанья:
"Леди или сэр, простите, но случилось мне вздремнуть,
Не расслышал я вначале, так вы тихо постучали,
Так вы робко постучали..." И решился я взглянуть,
Распахнул пошире двери, чтобы выйти и взглянуть, -
Тьма, - и хоть бы кто-нибудь!

Я стоял, во мрак вперяясь, грезам странным предаваясь,
Так мечтать наш смертный разум никогда не мог дерзнуть,
А немая ночь молчала, тишина не отвечала,
Только слово прозвучало - кто мне мог его шепнуть?
Я сказал "Линор" - и эхо мне ответ могло шепнуть...
Эхо - или кто-нибудь?

Я в смятенье оглянулся, дверь закрыл и в дом вернулся,
Стук неясный повторился, но теперь ясней чуть-чуть.
И сказал себе тогда я: "А, теперь я понимаю:
Это ветер, налетая, хочет ставни распахнуть,
Ну конечно, это ветер хочет ставни распахнуть...
Ветер - или кто-нибудь?"

Но едва окно открыл я, - вдруг, расправив гордо крылья,
Перья черные взъероша и выпячивая грудь,
Шагом вышел из-за штор он, с видом лорда древний ворон,
И, наверно, счел за вздор он в знак приветствия кивнуть.
Он взлетел на бюст Паллады, сел и мне забыл кивнуть,
Сел - и хоть бы что-нибудь!

В перья черные разряжен, так он мрачен был и важен!
Я невольно улыбнулся, хоть тоска сжимала грудь:
"Право, ты невзрачен с виду, но не дашь себя в обиду,
Древний ворон из Аида, совершивший мрачный путь
Ты скажи мне, как ты звался там, откуда держишь путь?"
Каркнул ворон: "Не вернуть!"

Я не мог не удивиться, что услышал вдруг от птицы
Человеческое слово, хоть не понял, в чем тут суть,
Но поверят все, пожалуй, что обычного тут мало:
Где, когда еще бывало, кто слыхал когда-нибудь,
Чтобы в комнате над дверью ворон сел когда-нибудь
Ворон с кличкой "Не вернуть"?

Словно душу в это слово всю вложив, он замер снова,
Чтоб опять молчать сурово и пером не шелохнуть.
"Где друзья? - пробормотал я. - И надежды растерял я,
Только он, кого не звал я, мне всю ночь терзает грудь...
Завтра он в Аид вернется, и покой вернется в грудь..."
Вдруг он каркнул: "Не вернуть!"

Вздрогнул я от звуков этих, - так удачно он ответил,
Я подумал: "Несомненно, он слыхал когда-нибудь
Слово это слишком часто, повторял его всечасно
За хозяином несчастным, что не мог и глаз сомкнуть,
Чьей последней, горькой песней, воплотившей жизни суть,
Стало слово "Не вернуть!"."

И в упор на птицу глядя, кресло к двери и к Палладе
Я придвинул, улыбнувшись, хоть тоска сжимала грудь,
Сел, раздумывая снова, что же значит это слово
И на что он так сурово мне пытался намекнуть.
Древний, тощий, темный ворон мне пытался намекнуть,
Грозно каркнув: "Не вернуть!"

Так сидел я, размышляя, тишины не нарушая,
Чувствуя, как злобным взором ворон мне пронзает грудь.
И на бархат однотонный, слабым светом озаренный.
Головою утомленной я склонился, чтоб уснуть...
Но ее, что так любила здесь, на бархате, уснуть,
Никогда уж не вернуть!

Вдруг - как звон шагов по плитам на полу, ковром покрытом!
Словно в славе фимиама серафимы держат путь!
"Бог,- вскричал я в исступленье,- шлет от страсти избавленье!
Пей, о, пей Бальзам Забвенья - и покой вернется в грудь!
Пей, забудь Линор навеки - и покой вернется в грудь! "
Каркнул ворон: "Не вернуть!"

"О вещун! Молю - хоть слово! Птица ужаса ночного!
Буря ли тебя загнала, дьявол ли решил швырнуть
В скорбный мир моей пустыни, в дом, где ужас правит ныне, -
В Галааде, близ Святыни, есть бальзам, чтобы заснуть?
Как вернуть покой, скажи мне, чтобы, все забыв, заснуть?"
Каркнул ворон: "Не вернуть!"

"О вещун! - вскричал я снова, - птица ужаса ночного!
Заклинаю небом, богом! Крестный свой окончив путь,
Сброшу ли с души я бремя? Отвечай, придет ли время,
И любимую в Эдеме встречу ль я когда-нибудь?
Вновь вернуть ее в объятья суждено ль когда-нибудь?"
Каркнул ворон: "Не вернуть!"

"Слушай, адское созданье! Это слово-знак прощанья!
Вынь из сердца клюв проклятый! В бурю и во мрак- твой путь!
Не роняй пера у двери, лжи твоей я не поверю!
Не хочу, чтоб здесь над дверью сел ты вновь когда-нибудь!
Одиночество былое дай вернуть когда-нибудь!"
Каркнул ворон: "Не вернуть!"

И не вздрогнет, не взлетит он, все сидит он, все сидит он,
Словно демон в дреме мрачной, взгляд навек вонзив мне в грудь,
Свет от лампы вниз струится, тень от ворона ложится,
И в тени зловещей птицы суждено душе тонуть...
Никогда из мрака душу, осужденную тонуть,
Не вернуть, о, не вернуть!"""


file = "tmp/raven-betaki.txt"

with open(file, 'wt') as fout:
    fout.write(text)

