#!/usr/bin/env python

# Mikhail (myke) Kolodin, 2022
# 2022-04-08 2022-04-08 1.0
# trans.py

# ~ транспонирование матрицы

import copy, random

N = 3

def pp(a):
    """красивая распечатка матрицы"""
    lena = len(a)
    for i in range(lena):
        for j in range(lena):
            print(f"{a[i][j]:5}", end=" ")
        print()
    print()
        

a = [[random.randint(0, 99) for i in range(N)] for j in range(N)]
pp(a)


def trans(aa):
    """транспонирование, на копии матрицы"""
    a = copy.deepcopy(aa)
    lena = len(a)
    for i in range(lena):
        for j in range(i+1, lena):
            a[i][j], a[j][i] = a[j][i], a[i][j]
    return a

b = trans(a)
pp(a)
pp(b)


   # ~ 38    54    75 
    # ~ 8    13    65 
    # ~ 4    90    35 

   # ~ 38     8     4 
   # ~ 54    13    90 
   # ~ 75    65    35 


   # ~ 60    34    61    42    14     7    18    89    43 
   # ~ 43    29    68    39    84    52    11    85    39 
   # ~ 78    97    79    18    17    76    21     3    96 
   # ~ 86     4    43    93    66    87    53    25    72 
   # ~ 19     2    72    56    40    52    72     6    82 
   # ~ 73    89    84    23    35    20    52    62    82 
   # ~ 19    40    11    40    76    16    91    35    28 
   # ~ 49    47    60    31     4    33    27     8    51 
   # ~ 64     5    65     6    10    81    69    78    57 

   # ~ 60    43    78    86    19    73    19    49    64 
   # ~ 34    29    97     4     2    89    40    47     5 
   # ~ 61    68    79    43    72    84    11    60    65 
   # ~ 42    39    18    93    56    23    40    31     6 
   # ~ 14    84    17    66    40    35    76     4    10 
    # ~ 7    52    76    87    52    20    16    33    81 
   # ~ 18    11    21    53    72    52    91    27    69 
   # ~ 89    85     3    25     6    62    35     8    78 
   # ~ 43    39    96    72    82    82    28    51    57 
