#!/usr/bin/env python

# Mikhail (myke) Kolodin, 2024
# 2026-03-22 2026-03-22 0.1
# all-bads.py
# Плохие идеи для питона

# ~ --- sum ---

# ~ def sum():
    # ~ s = 1+   2 +3+   4 +5 + 9+8  +7  +6
    # ~ return s

# ~ ps = sum(); print(ps)

# ~ --- 

# ~ - использование имени станд. функции, имя теперь в программе недоступно
# ~ - неравномерная запись выражения
# ~ - выражение лучше записывать по порядку, напр., по возрастанию, иначе легко что-нибудь пропустить
# ~ - можно сократить
# ~ - диапазон можно передать как парамитр, иначе функция может применяться только для одного вычисления
# ~ - то, что мы узнали о возможности записи нескольких команд в 1 строку, не значит, что так и надо поступать;
# ~ обычно пишут по общим правилам
# ~ - полезно делать описание функции в строке документирования
# ~ - print(sum(range(10)))

# ~ ---
