#!/usr/bin/env python

# Mikhail (myke) Kolodin, 2025
# chain-num-1int.py 2025-01-262025-01-27 1.1

from itertools import pairwise

# ~ Цепочки чисел - 2
# ~ -----------------------------------------------

# ~ Даны несколько чисел (это список именно целых чисел).
# ~ Верно ли, что они записаны цепочкой вида  13, 356, 671, 1, 12 ?
# ~ т.е. последняя цирфа очередного равна первой цифре следующего.
# ~ это версия не на строках, а с настоящими целыми числами,
# ~ которые надо преобразовывать к строкам для решения

# -------------------------------------
# тайно делаем набор для проверки

from random import randint


def make(many = 10):
    """
    построить тестовый набор,
    many  - сколько чисел
    returns: list
    """

    arr = [ 0 for _ in range(many) ]
    arr[0] = randint(1, 9)

    for i in range(1, many):
        arr[i] = arr[i-1] % 10 * 100 + randint(0, 9) * 10 + randint(1, 9)

    if randint(0, 1):
        for i in range(many):
            arr[i] *= randint(1, 2)

    return arr

# -------------------------------------
# решаем

def solve(s):
    """решаем 1 пример"""

    s = list( map( str, s))
    return "да" if all( s1[-1] == s2[0] for s1, s2 in pairwise(s) ) else "нет"


def main(many = 1):
    """решаем все примеры"""
    
    for inum in range(many):
        sample = make(many)
        print(sample, "=>", solve(sample))

main(10)

# ---------------------------------------------------
# результат:

# ~ 13 356 671 1 12 => да
# ~ 122345 67890 6543 7654 9876 => нет
# ~ 12 23 34 45 56 67 78 89 90 => да
# ~ 123 345 567 789 901 12 => да
# ~ 1234 4567 7890 => да
# ~ 1 2 3 4 5 6 7 8 9 0 => нет

# -------------------------- конец --------------------
