#!/usr/bin/env python

# Mikhail (myke) Kolodin, 2026
# count-years.py
# 2026-07-14 2026-07-14 1.2

# ~ укажи основные используемые сейчас  в мире системы летосчисления (name) (и добавь к ним счисление от сотворения мира), какой  там сейчас год (year), в каких основных странах используется каждая система (lands: list[str]),  когда (по григорианскому календарю) он наступил (str, "YYYY-MM-DD"); формат list[dict], ключи англ.

calendars = [
    {
        "name": "Григорианский календарь",
        "year": 2026,
        "lands": [
            "Большинство стран мира",
            "США",
            "Страны ЕС",
            "Россия",
            "Китай"
        ],
        "start_date": "2026-01-01"
    },
    {
        "name": "Византийский календарь (от Сотворения мира / Адама)",
        "year": 7534,
        "lands": [
            "Используется в богослужении некоторыми православными церквями",
            "Часть старообрядческих общин",
            "Афонские монастыри"
        ],
        "start_date": "2025-09-14"
    },
    {
        "name": "Еврейский календарь (от Сотворения мира)",
        "year": 5786,
        "lands": [
            "Израиль"
        ],
        "start_date": "2025-09-22"
    },
    {
        "name": "Исламский календарь (Лунная Хиджра)",
        "year": 1448,
        "lands": [
            "Саудовская Аравия",
            "ОАЭ",
            "Иран",
            "Египет",
            "Большинство стран мусульманского мира"
        ],
        "start_date": "2026-06-16"
    },
    {
        "name": "Персидский календарь (Солнечная Хиджра)",
        "year": 1405,
        "lands": [
            "Иран",
            "Афганистан"
        ],
        "start_date": "2026-03-21"
    },
    {
        "name": "Китайский календарь (Лунный)",
        "year": 4724,
        "lands": [
            "Китай",
            "Тайвань",
            "Сингапур",
            "Малайзия"
        ],
        "start_date": "2026-02-17"
    },
    {
        "name": "Буддийский календарь",
        "year": 2569,
        "lands": [
            "Таиланд",
            "Камбоджа",
            "Лаос",
            "Мьянма",
            "Шри-Ланка"
        ],
        "start_date": "2026-04-13"
    },
    {
        "name": "Эфиопский календарь",
        "year": 2018,
        "lands": [
            "Эфиопия",
            "Эритрея"
        ],
        "start_date": "2025-09-11"
    }
]

# -------------------------------------------------

print("\n1. сколько всего основных календарей?")

print(len(calendars))

# -------------------------------------------------

print("\n2. какой самый древний?")

data = [(cal['year'], cal['name']) for cal in calendars ]
old, nomo = sorted(data)[-1]

print(f"это {nomo} ({old} лет)")

# -------------------------------------------------
print()
