#!/usr/bin/env python

# Mikhail (myke) Kolodin, 2022
# 2024-11-15 2024-11-5 0.1
# crossword1.py

# Даны 2 слова. Построить кроссворд из этих 2 слов,
# т.е. вписать их в пересечённом виде на 2-мерной таблице.

vocab = 'alfa bravo charlie delta echo foxtrot golf hotel india juliett kilo lima mike november oscar' \
    'papa quebec romeo sierra tango uniform victor whiskey xray yankee zulu'

print(vocab)
