#!/usr/bin/env python

# Mikhail (myke) Kolodin, 2026
# defencer.py
# 2026-06-27 2026-06-27 1.0

# ~ перечисли страны мира (name) с населением (population) более миллиона, указав тип правления (rule: республика, монархия, прочее), квалификацию руководителя (qual: гражданский, военный, спецслужбы, прочее), квалификацию министра обороны (или войны) (defencer: гражданский, военный, спецслужбы, прочее); 
# ~ формат lsit[dict], ключи по-англ., значения по-русски.

# -------------------------- данные -------------------------

data = [
  {
    "name": "Китай",
    "population": 1419000000,
    "rule": "прочее",
    "qual": "гражданский",
    "defencer": "военный"
  },
  {
    "name": "Индия",
    "population": 1408000000,
    "rule": "республика",
    "qual": "гражданский",
    "defencer": "гражданский"
  },
  {
    "name": "США",
    "population": 335000000,
    "rule": "республика",
    "qual": "гражданский",
    "defencer": "гражданский"
  },
  {
    "name": "Индонезия",
    "population": 277000000,
    "rule": "республика",
    "qual": "военный",
    "defencer": "гражданский"
  },
  {
    "name": "Пакистан",
    "population": 240000000,
    "rule": "республика",
    "qual": "гражданский",
    "defencer": "гражданский"
  },
  {
    "name": "Нигерия",
    "population": 224000000,
    "rule": "республика",
    "qual": "гражданский",
    "defencer": "гражданский"
  },
  {
    "name": "Бразилия",
    "population": 216000000,
    "rule": "республика",
    "qual": "гражданский",
    "defencer": "гражданский"
  },
  {
    "name": "Бангладеш",
    "population": 173000000,
    "rule": "прочее",
    "qual": "гражданский",
    "defencer": "гражданский"
  },
  {
    "name": "Россия",
    "population": 146000000,
    "rule": "республика",
    "qual": "спецслужбы",
    "defencer": "гражданский"
  },
  {
    "name": "Мексика",
    "population": 128000000,
    "rule": "республика",
    "qual": "гражданский",
    "defencer": "военный"
  },
  {
    "name": "Япония",
    "population": 124000000,
    "rule": "монархия",
    "qual": "гражданский",
    "defencer": "гражданский"
  },
  {
    "name": "Филиппины",
    "population": 117000000,
    "rule": "республика",
    "qual": "гражданский",
    "defencer": "военный"
  },
  {
    "name": "Египет",
    "population": 112000000,
    "rule": "республика",
    "qual": "военный",
    "defencer": "военный"
  },
  {
    "name": "Вьетнам",
    "population": 98000000,
    "rule": "прочее",
    "qual": "спецслужбы",
    "defencer": "военный"
  },
  {
    "name": "Германия",
    "population": 84000000,
    "rule": "республика",
    "qual": "гражданский",
    "defencer": "гражданский"
  },
  {
    "name": "Турция",
    "population": 85000000,
    "rule": "республика",
    "qual": "гражданский",
    "defencer": "военный"
  },
  {
    "name": "Иран",
    "population": 89000000,
    "rule": "прочее",
    "qual": "прочее",
    "defencer": "военный"
  },
  {
    "name": "Франция",
    "population": 68000000,
    "rule": "республика",
    "qual": "гражданский",
    "defencer": "гражданский"
  },
  {
    "name": "Великобритания",
    "population": 67000000,
    "rule": "монархия",
    "qual": "гражданский",
    "defencer": "гражданский"
  },
  {
    "name": "Таиланд",
    "population": 71000000,
    "rule": "монархия",
    "qual": "гражданский",
    "defencer": "военный"
  },
  {
    "name": "ЮАР",
    "population": 60000000,
    "rule": "республика",
    "qual": "гражданский",
    "defencer": "гражданский"
  },
  {
    "name": "Италия",
    "population": 59000000,
    "rule": "республика",
    "qual": "гражданский",
    "defencer": "гражданский"
  },
  {
    "name": "Южная Корея",
    "population": 51000000,
    "rule": "республика",
    "qual": "гражданский",
    "defencer": "военный"
  },
  {
    "name": "Саудовская Аравия",
    "population": 36000000,
    "rule": "монархия",
    "qual": "гражданский",
    "defencer": "гражданский"
  },
  {
    "name": "КНДР",
    "population": 26000000,
    "rule": "прочее",
    "qual": "гражданский",
    "defencer": "военный"
  }
]

# -------------------------- подготовка -------------------------

from pprint import pprint
from collections import Counter

# -------------------------- расчёт -------------------------

# ---------- тест 1 ----------

print('1. сколько каких руководителей и защитников по всем странам?')

head = Counter( [ x['qual'] for x in data ] )
print(head)

defencer = Counter( [ x['defencer'] for x in data ] )
print(defencer)

# ~ 1. сколько каких руководителей и защитников по всем странам?
# ~ Counter({'гражданский': 20, 'военный': 2, 'спецслужбы': 2, 'прочее': 1})
# ~ Counter({'гражданский': 15, 'военный': 10})

# -------------------------- конец -------------------------
