# Mikhail Kolodin
# 2022-04-22 2022-04-22 v.1.0

# ~ Дан случайный список.
# ~ Распечатать те числа из него, которые делятся на 7, причём в порядке возрастания,
# ~ с указанием количества таких чисел

from random import randint as ri

MAX = 100   # макс. число
LEN = 100   # длина списка

# генерируем случайный список
a = [ri(1, MAX) for _ in range(LEN)]
print("исходный список:\n", a)
# ~ print(sorted(a))


def div7(a):
    """сделать нужный список"""
    return (q := sorted([x for x in a if x%7==0]), len(q))
    
q = div7(a)
print("\n\nсемёрки:", ", " .join (map(str, q[0])), "\nдлина:  ", q[1])
# ~ print("\n\nсемёрки:", q[0], "\nдлина:  ", q[1])


# ~ пример работы:

# ~ исходный список:
 # ~ [94, 46, 88, 88, 94, 51, 2, 58, 48, 49, 75, 47, 9, 87, 43, 24, 91, 64, 69, 86, 83, 43, 36, 78, 36, 72, 16, 40, 64, 94, 74, 93, 26, 66, 18, 48, 60, 76, 78, 45, 41, 25, 30, 37, 21, 47, 40, 48, 83, 50, 92, 8, 8, 38, 92, 28, 17, 78, 99, 69, 57, 30, 14, 51, 35, 76, 52, 52, 20, 27, 6, 21, 28, 83, 48, 98, 67, 83, 27, 75, 83, 25, 16, 84, 98, 30, 72, 61, 3, 98, 92, 6, 27, 41, 35, 81, 72, 6, 15, 95]


# ~ семёрки: 14, 21, 21, 28, 28, 35, 35, 49, 84, 91, 98, 98, 98 
# ~ длина:   13
