# Mikhail Kolodin
# 2022-04-22 2022-04-22 v.1.1

# ~ Дан случайный список.
# ~ Распечатать те числа из него, которые делятся на 7, причём в порядке возрастания,
# ~ с указанием количества таких чисел

from random import randint as ri

MAX = 100   # макс. число
LEN = 100   # длина списка

# генерируем случайный список
a = [ri(1, MAX) for _ in range(LEN)]
print("исходный список:\n", a)
print(sorted(a))


def div7(a):
    """сделать нужный список"""
    return (q := sorted([x for x in a if x%7==0]), len(q))
    
sevens, length = div7(a)
print("\n\nсемёрки:", ", " .join (map(str, sevens)), "\nдлина:  ", length)
# ~ print("\n\nсемёрки:", sevens, "\nдлина:  ", length)


# ~ пример работы:

# ~ исходный список:
 # ~ [54, 21, 30, 96, 45, 92, 23, 61, 47, 70, 76, 6, 13, 75, 63, 87, 2, 9, 98, 59, 76, 18, 70, 91, 33, 46, 80, 77, 97, 23, 75, 64, 3, 54, 70, 17, 31, 55, 48, 95, 9, 100, 47, 92, 5, 100, 48, 9, 58, 15, 84, 66, 27, 84, 79, 53, 47, 17, 60, 43, 28, 79, 28, 57, 87, 29, 12, 96, 22, 98, 17, 66, 83, 60, 32, 98, 86, 9, 98, 61, 61, 34, 78, 59, 42, 65, 84, 79, 89, 74, 57, 19, 9, 90, 40, 23, 53, 3, 6, 7]
# ~ [2, 3, 3, 5, 6, 6, 7, 9, 9, 9, 9, 9, 12, 13, 15, 17, 17, 17, 18, 19, 21, 22, 23, 23, 23, 27, 28, 28, 29, 30, 31, 32, 33, 34, 40, 42, 43, 45, 46, 47, 47, 47, 48, 48, 53, 53, 54, 54, 55, 57, 57, 58, 59, 59, 60, 60, 61, 61, 61, 63, 64, 65, 66, 66, 70, 70, 70, 74, 75, 75, 76, 76, 77, 78, 79, 79, 79, 80, 83, 84, 84, 84, 86, 87, 87, 89, 90, 91, 92, 92, 95, 96, 96, 97, 98, 98, 98, 98, 100, 100]


# ~ семёрки: 7, 21, 28, 28, 42, 63, 70, 70, 70, 77, 84, 84, 84, 91, 98, 98, 98, 98 
# ~ длина:   18
