#!/usr/bin/env python

# Mikhail (myke) Kolodin, 2026
# euro-demo.py
# 2026-06-25 2026-06-25 1.2

# ~ Изучаем Европу. 
# ~ Формат: list[dict], все ключи по-англ., текст по-русски.
# ~ По каждой стране укажи:
# ~ - название,
# ~ - население,
# ~ - список национальностей (формат: dict[название: численность]).
# ~ включи все страны с населением более 1 миллиона

# ~ Ниже представлен полный список европейских стран (включая государства с территориями в двух частях света), чье население на 2026 год превышает 1 миллион человек. Всего в перечень вошло 39 стран.

# ~ Примечание: Данные поля pop (население) приведены в тысячах человек. Численность этнических групп в поле ethnicities также указана в тысячах и отражает либо официальные переписи, либо данные национальных служб учета резидентов с выделением ключевых диаспор последних лет.

# ~ (Примечание: Люксембург включен в список справочно замыкающим элементом как важнейший финансовый узел региона, несмотря на то, что его население балансирует на отметке около 680 тысяч).

# ---------------------------------------------------

europe = [
    {
        "name": "Россия",
        "pop": 146150,
        "ethnicities": {
            "Русские": 105580,
            "Татары": 4710,
            "Чеченцы": 1670,
            "Башкиры": 1570,
            "Чуваши": 1060,
            "Другие": 31560
        }
    },
    {
        "name": "Германия",
        "pop": 84075,
        "ethnicities": {
            "Немцы": 61250,
            "Турки": 2950,
            "Украинцы": 1200,
            "Сирийцы": 980,
            "Поляки": 870,
            "Румыны": 820,
            "Другие": 16005
        }
    },
    {
        "name": "Великобритания",
        "pop": 69551,
        "ethnicities": {
            "Англичане": 51200,
            "Шотландцы": 4510,
            "Индийцы": 1950,
            "Пакистанцы": 1630,
            "Валлийцы": 1520,
            "Ирландцы": 520,
            "Другие": 8221
        }
    },
    {
        "name": "Франция",
        "pop": 66650,
        "ethnicities": {
            "Французы": 56250,
            "Алжирцы": 1900,
            "Марокканцы": 1500,
            "Португальцы": 620,
            "Итальянцы": 310,
            "Другие": 6070
        }
    },
    {
        "name": "Италия",
        "pop": 58900,
        "ethnicities": {
            "Итальянцы": 53540,
            "Румыны": 1080,
            "Албанцы": 420,
            "Марокканцы": 400,
            "Китайцы": 310,
            "Другие": 3150
        }
    },
    {
        "name": "Испания",
        "pop": 47900,
        "ethnicities": {
            "Испанцы": 41010,
            "Марокканцы": 890,
            "Румыны": 630,
            "Колумбийцы": 440,
            "Британцы": 290,
            "Другие": 4640
        }
    },
    {
        "name": "Украина",
        "pop": 37500,
        "ethnicities": {
            "Украинцы": 31200,
            "Русские": 4900,
            "Белорусы": 150,
            "Молдаване": 140,
            "Другие": 1110
        }
    },
    {
        "name": "Польша",
        "pop": 37600,
        "ethnicities": {
            "Поляки": 35710,
            "Украинцы": 1420,
            "Белорусы": 110,
            "Силезцы": 60,
            "Другие": 300
        }
    },
    {
        "name": "Румыния",
        "pop": 18700,
        "ethnicities": {
            "Румыны": 16750,
            "Венгры": 1000,
            "Цыгане": 570,
            "Украинцы": 50,
            "Другие": 330
        }
    },
    {
        "name": "Нидерланды",
        "pop": 18150,
        "ethnicities": {
            "Голландцы": 13740,
            "Турки": 440,
            "Марокканцы": 420,
            "Суринамцы": 360,
            "Немцы": 340,
            "Другие": 2850
        }
    },
    {
        "name": "Бельгия",
        "pop": 11900,
        "ethnicities": {
            "Фламандцы": 6790,
            "Валлоны": 3660,
            "Марокканцы": 340,
            "Французы": 310,
            "Итальянцы": 280,
            "Другие": 520
        }
    },
    {
        "name": "Чехия",
        "pop": 10850,
        "ethnicities": {
            "Чехи": 9050,
            "Моравы": 360,
            "Украинцы": 630,
            "Словаки": 100,
            "Вьетнамцы": 70,
            "Другие": 640
        }
    },
    {
        "name": "Швеция",
        "pop": 10700,
        "ethnicities": {
            "Шведы": 8220,
            "Сирийцы": 240,
            "Иракцы": 150,
            "Финны": 140,
            "Поляки": 100,
            "Другие": 1850
        }
    },
    {
        "name": "Португалия",
        "pop": 10400,
        "ethnicities": {
            "Португальцы": 9420,
            "Бразильцы": 400,
            "Ангольцы": 110,
            "Кабовердинцы": 50,
            "Другие": 420
        }
    },
    {
        "name": "Греция",
        "pop": 9900,
        "ethnicities": {
            "Греки": 8920,
            "Албанцы": 490,
            "Пакистанцы": 70,
            "Грузины": 50,
            "Другие": 370
        }
    },
    {
        "name": "Венгрия",
        "pop": 9500,
        "ethnicities": {
            "Венгры": 8150,
            "Цыгане": 320,
            "Немцы": 60,
            "Словаки": 30,
            "Другие": 940
        }
    },
    {
        "name": "Австрия",
        "pop": 9200,
        "ethnicities": {
            "Австрийцы": 7250,
            "Немцы": 230,
            "Сербы": 190,
            "Румыны": 140,
            "Турки": 120,
            "Другие": 1270
        }
    },
    {
        "name": "Белоруссия",
        "pop": 9150,
        "ethnicities": {
            "Белорусы": 7660,
            "Русские": 700,
            "Поляки": 290,
            "Украинцы": 160,
            "Другие": 340
        }
    },
    {
        "name": "Швейцария",
        "pop": 8800,
        "ethnicities": {
            "Швейцарцы": 6530,
            "Итальянцы": 340,
            "Немцы": 320,
            "Португальцы": 260,
            "Французы": 150,
            "Другие": 1200
        }
    },
    {
        "name": "Сербия",
        "pop": 6600,
        "ethnicities": {
            "Сербы": 5510,
            "Венгры": 190,
            "Цыгане": 150,
            "Босняки": 140,
            "Другие": 610
        }
    },
    {
        "name": "Болгария",
        "pop": 6200,
        "ethnicities": {
            "Болгары": 5210,
            "Турки": 510,
            "Цыгане": 270,
            "Другие": 210
        }
    },
    {
        "name": "Дания",
        "pop": 6050,
        "ethnicities": {
            "Датчане": 5210,
            "Турки": 65,
            "Поляки": 50,
            "Сирийцы": 45,
            "Другие": 680
        }
    },
    {
        "name": "Финляндия",
        "pop": 5600,
        "ethnicities": {
            "Финны": 5080,
            "Шведы": 290,
            "Русские": 40,
            "Эстонцы": 30,
            "Другие": 160
        }
    },
    {
        "name": "Ирландия",
        "pop": 5550,
        "ethnicities": {
            "Ирландцы": 4620,
            "Поляки": 100,
            "Британцы": 90,
            "Индийцы": 60,
            "Другие": 680
        }
    },
    {
        "name": "Словакия",
        "pop": 5400,
        "ethnicities": {
            "Словаки": 4530,
            "Венгры": 420,
            "Цыгане": 70,
            "Чехи": 30,
            "Другие": 350
        }
    },
    {
        "name": "Норвегия",
        "pop": 5500,
        "ethnicities": {
            "Норвежцы": 4580,
            "Поляки": 110,
            "Литовцы": 50,
            "Сомалийцы": 30,
            "Другие": 730
        }
    },
    {
        "name": "Хорватия",
        "pop": 3850,
        "ethnicities": {
            "Хорваты": 3520,
            "Сербы": 120,
            "Босняки": 25,
            "Итальянцы": 14,
            "Другие": 171
        }
    },
    {
        "name": "Молдавия",
        "pop": 2500,
        "ethnicities": {
            "Молдаване": 1880,
            "Украинцы": 160,
            "Русские": 100,
            "Гагаузы": 110,
            "Болгары": 50,
            "Другие": 200
        }
    },
    {
        "name": "Босния и Герцеговина",
        "pop": 3200,
        "ethnicities": {
            "Босняки": 1620,
            "Сербы": 980,
            "Хорваты": 490,
            "Другие": 110
        }
    },
    {
        "name": "Албания",
        "pop": 2750,
        "ethnicities": {
            "Албанцы": 2650,
            "Греки": 25,
            "Цыгане": 10,
            "Другие": 65
        }
    },
    {
        "name": "Литва",
        "pop": 2850,
        "ethnicities": {
            "Литовцы": 2410,
            "Поляки": 180,
            "Русские": 140,
            "Белорусы": 50,
            "Другие": 70
        }
    },
    {
        "name": "Северная Македония",
        "pop": 1830,
        "ethnicities": {
            "Македонцы": 1070,
            "Албанцы": 450,
            "Турки": 70,
            "Цыгане": 50,
            "Сербы": 24,
            "Другие": 166
        }
    },
    {
        "name": "Словения",
        "pop": 2100,
        "ethnicities": {
            "Словенцы": 1740,
            "Сербы": 40,
            "Хорваты": 37,
            "Босняки": 33,
            "Другие": 250
        }
    },
    {
        "name": "Латвия",
        "pop": 1850,
        "ethnicities": {
            "Латыши": 1150,
            "Русские": 450,
            "Белорусы": 60,
            "Украинцы": 40,
            "Поляки": 35,
            "Другие": 115
        }
    },
    {
        "name": "Косово",
        "pop": 1650,
        "ethnicities": {
            "Албанцы": 1530,
            "Сербы": 75,
            "Босняки": 25,
            "Другие": 20
        }
    },
    {
        "name": "Эстония",
        "pop": 1360,
        "ethnicities": {
            "Эстонцы": 930,
            "Русские": 300,
            "Украинцы": 60,
            "Белорусы": 15,
            "Другие": 55
        }
    },
    {
        "name": "Кипр",
        "pop": 1380,
        "ethnicities": {
            "Греки-киприоты": 900,
            "Турки-киприоты": 290,
            "Британцы": 35,
            "Русские": 30,
            "Другие": 125
        }
    },
    {
        "name": "Люксембург",
        "pop": 680,
        "ethnicities": {
            "Люксембуржцы": 360,
            "Португальцы": 100,
            "Французы": 50,
            "Итальянцы": 25,
            "Другие": 145
        }
    }
]

# ---------------------------------------------------

from collections import Counter, defaultdict
from pprint import pprint

# ---------------------------------------------------

print("\n#1. сколько всего стран и народов?")

pip = set()
for land in europe:
    pip |= set(land['ethnicities'].keys())

print(f"""
всего стран:   {len(europe)}
всего народов: {len(pip)}
""")

# ~ #1. сколько всего стран и народов?

# ~ всего стран:   38
# ~ всего народов: 67

# ---------------------------------------------------

print("\n#2. покажи процент титульного народа")

pcs = []

for land in europe:
    tot = land['pop']
    own = list(land['ethnicities'].values())[0]
    pc  = own / tot
    pcs.append((land['name'], pc))    

pcs.sort(key = lambda x: x[1], reverse=True)

for pc in pcs:
    print(f"{pc[0]:20} {pc[1]*100:.2f}%")

# ~ #2. покажи процент титульного народа
# ~ Албания              96.36%
# ~ Польша               94.97%
# ~ Косово               92.73%
# ~ Хорватия             91.43%
# ~ Италия               90.90%
# ~ Финляндия            90.71%
# ~ Португалия           90.58%
# ~ Греция               90.10%
# ~ Румыния              89.57%
# ~ Дания                86.12%
# ~ Венгрия              85.79%
# ~ Испания              85.62%
# ~ Литва                84.56%
# ~ Франция              84.40%
# ~ Болгария             84.03%
# ~ Словакия             83.89%
# ~ Белоруссия           83.72%
# ~ Сербия               83.48%
# ~ Чехия                83.41%
# ~ Норвегия             83.27%
# ~ Ирландия             83.24%
# ~ Украина              83.20%
# ~ Словения             82.86%
# ~ Австрия              78.80%
# ~ Швеция               76.82%
# ~ Нидерланды           75.70%
# ~ Молдавия             75.20%
# ~ Швейцария            74.20%
# ~ Великобритания       73.62%
# ~ Германия             72.85%
# ~ Россия               72.24%
# ~ Эстония              68.38%
# ~ Кипр                 65.22%
# ~ Латвия               62.16%
# ~ Северная Македония   58.47%
# ~ Бельгия              57.06%
# ~ Люксембург           52.94%
# ~ Босния и Герцеговина 50.62%

# ---------------------------------------------------
print()
