#!/usr/bin/env python
# Mikhail Kolodin, 2024
# find-pairs.py
# 2024-10-11 2024-10-11 1.0
# найти пару одинаковых соседних чисел в матрице
# (соседство - по горизонтали или вертикали)

import random

def mp(a, width=4):
    """напечатать матрицу"""

    for i in range(10):
        for j in range(10):
            print("%4d" % a[i][j], end="")
        print()


def find_pairs(a):
    """найти пару"""

    size = len(a)
    for i in range(size-1):
        for j in range(size-1):
            if a[i][j] == a[i][j+1] or a[i][j] == a[i+1][j]:
                return True, i, j, a[i][j]

    return False,


def test(times=1):
    """запуск times тестов"""

    for time in range(1, times+1):
        print(f"тест {time}")
        a = [[random.randint(0, 99) for _ in range(10)] for _ in range(10)]        
        mp(a)
        print(find_pairs(a))


test()

# ~ тест 1
  # ~ 96   8  86   7  62  41   5  99   5   1
  # ~ 82  87  60  36  63  32  65  38  86  54
  # ~ 33  34  18  47  57  23  20  79  79  70
   # ~ 9  90  87  60  32  87  39   5  47  94
  # ~ 23  43  14  68  23  82  56  98  86  96
  # ~ 37  45  80  58  75  24  95  87  65  89
  # ~ 46  28  57   6  89   6  42  48  96  23
   # ~ 9  67  78  14  71  28  84  84  73  47
  # ~ 39  85  50  71  34  16  48  17  49  64
  # ~ 50  36  80  13  22  43  98   5  44  47
# ~ (True, 2, 7, 79)

# ~ тест 1
  # ~ 82   7  96  57  84  83   9   3  63  80
  # ~ 35  97  52  92  48  20  83  63  23  41
  # ~ 41  92  67  26  90  86  25  30  29  80
  # ~ 14  30  84  59  63  31  97  47  23  51
  # ~ 96  84  89   0  44   1  10  92   1  12
  # ~ 24  67  48   7  90  39  72  68  15  52
  # ~ 87  37  14  22  23  17   5  28  79  44
  # ~ 73  93  35  15  62  16  62  54  14  85
  # ~ 38  25  14  66  13  23  93  19  45  50
  # ~ 69  55  19  39  98  33  36  24  82  10
# ~ (False,)

