#!python3.10

# Mikhail (myke) Kolodin, 2021
# 2021-11-26 2021-11-26 0.1
# fly-trains.py
# про поезда и муху между ними

# ~ Постановка задачи.
# ~ Из города А в город Б, между которыми расстояние dab,
# ~ вышел поезд со скоростью va км/ч,
# ~ одновременно из Б в А тоже вышел поезд со скоростью vb км/ч.
# ~ Вместе с поездом А с его лобового стекла слетела муха
# ~ и полетела навстречу поезду Б со скоростью vk км/ч
# ~ (vm > va, vm > vb).
# ~ Встретив поезд, Б муха тут же развернулась и полетела навстречу
# ~ поезду А и т.п.
# ~ Сколько пролетит муха, прежде чем поезда встретятся?

def var1():
    """ расчёт по общему времени движения
    """
    ...

def var2():
    """ расчёт суммированием ряда
    """
    ...

var1()
var2()
