#!/usr/bin/env python
# myke 2026-06-08 2026-06-18 2.2
# gamma.py

# Простая гамма

# Частота (высота) ноты ля (А) 1 октавы равна 440 Гц.
# Каждая следующая нота больше, а предыдущая - меньше ровно на корень 12 степени из 2.
# Напечатать таблицу отношений между всеми нотами 1 октавы (а также до 2 октавы).
# 'c' это 'C4', 'C' это 'C5', 'C2' это 'C6'

mul = 2**(1/12)
print("множитель:", mul)

notes = "c c# d d# e f f# g g# a b h C C# D D# E F F# G G# A B H C2".split()

freqs = {}
freqs['a'] = 440.

nf = 440.
for note in "c c# d d# e f f# g g#".split()[::-1]:
    freqs[note] = nf / mul
    nf /= mul
nf = 440.
for note in "b h C C# D D# E F F# G G# A B H C2".split():
    freqs[note] = nf * mul
    nf *= mul

print("частоты:", freqs, "\n")

print("%8s" % "", end="")
for second in notes:
    print("%-6s" % second, end="")
print()
for first in notes:
    print("%6s" % first, end="")
    for second in notes:
        print("%6.2f" % (freqs[second] / freqs[first]), end="")
    print()        

print()


# ~ частоты: {'A': 440.0, 'G#': 415.3046975799451, 'G': 391.99543598174927, 'F#': 369.99442271163434, 'F': 349.2282314330038, 'E': 329.62755691286986, 'D#': 311.1269837220808, 'D': 293.66476791740746, 'C#': 277.18263097687196, 'C': 261.6255653005985, 'B': 466.1637615180899, 'H': 493.8833012561241, 'C2': 523.2511306011974} 

            # ~ C       C#      D       D#      E       F       F#      G       G#      A       B       H       C2      
       # ~ C    1.00    1.06    1.12    1.19    1.26    1.33    1.41    1.50    1.59    1.68    1.78    1.89    2.00
      # ~ C#    0.94    1.00    1.06    1.12    1.19    1.26    1.33    1.41    1.50    1.59    1.68    1.78    1.89
       # ~ D    0.89    0.94    1.00    1.06    1.12    1.19    1.26    1.33    1.41    1.50    1.59    1.68    1.78
      # ~ D#    0.84    0.89    0.94    1.00    1.06    1.12    1.19    1.26    1.33    1.41    1.50    1.59    1.68
       # ~ E    0.79    0.84    0.89    0.94    1.00    1.06    1.12    1.19    1.26    1.33    1.41    1.50    1.59
       # ~ F    0.75    0.79    0.84    0.89    0.94    1.00    1.06    1.12    1.19    1.26    1.33    1.41    1.50
      # ~ F#    0.71    0.75    0.79    0.84    0.89    0.94    1.00    1.06    1.12    1.19    1.26    1.33    1.41
       # ~ G    0.67    0.71    0.75    0.79    0.84    0.89    0.94    1.00    1.06    1.12    1.19    1.26    1.33
      # ~ G#    0.63    0.67    0.71    0.75    0.79    0.84    0.89    0.94    1.00    1.06    1.12    1.19    1.26
       # ~ A    0.59    0.63    0.67    0.71    0.75    0.79    0.84    0.89    0.94    1.00    1.06    1.12    1.19
       # ~ B    0.56    0.59    0.63    0.67    0.71    0.75    0.79    0.84    0.89    0.94    1.00    1.06    1.12
       # ~ H    0.53    0.56    0.59    0.63    0.67    0.71    0.75    0.79    0.84    0.89    0.94    1.00    1.06
      # ~ C2    0.50    0.53    0.56    0.59    0.63    0.67    0.71    0.75    0.79    0.84    0.89    0.94    1.00
