#!/usr/bin/env python

# Mikhail (myke) Kolodin, 2025
# 2025-11-21 2025-11-11 1.0
# graph-map.py

# Рекурсивный обход графа с циклами, поиск пути.
# Не требуется нахождение оптимального (в любом смысле) пути.

DEBUG = 0
# ~ DEBUG = 1

mapa = [
    ["Санкт-Петербург", "Великий Новгород"],
    ["Великий Новгород", "Тверь"],
    ["Тверь", "Москва"],
    ["Тверь", "Ярославль"],
    ["Москва", "Ярославль"],
    ["Москва", "Смоленск"],
    ["Москва", "Тула"],
    ["Москва", "Рязань"],
    ["Москва", "Владимир"],
    ["Смоленск", "Витебск"],
    ["Смоленск", "Брянск"],
    ["Брянск", "Орёл"],
    ["Орёл", "Тамбов"],
    ["Орёл", "Тула"],
    ["Тула", "Рязань"],
    ["Рязань", "Владимир"],
    ["Ярославль", "Вологда"],
    ["Ярославль", "Кострома"],
    ["Витебск", "Минск"],
    ["Киев", "Одесса"],
    ["Киев", "Харьков"],
    ["Одесса", "Харьков"],
]


def showway(a, b):
    """напечатать путь или сказать, что его нет:
    (True, list) или (False)
    """
    global mapa

    print("\n\n==================================================\n")
    print("\nПуть от города", a, "до города", b, ":")

    nl = []
    for x, y in mapa:
        nl.append((x, y))
        nl.append((y, x))

    mapa = sorted(set(nl))
    # ~ print(mapa)

    path = [a]

    if a == b:
        print("Путь есть: уже приехали!", end=" ")
        print(*path, sep=" -> ")

    res, p = way(a, b, path)
    if res:
        print("\nПуть есть! ", end="")
        print(*p, sep=" -> ")
    else:        
        print("\nПуть не существует.\n")


def way(a, b, path):
    """найти путь или вернуть False"""

    if a == b:
        return True, path

    if(DEBUG): print("* ищем путь от города", a, "до города", b, "(путь уже таков:", path, ")")

    for nc in [c[1] for c in mapa if c[0] == a and c[1] not in path]:
        if(DEBUG): print("путь:", path, ", кандидат:", nc)
        path.append(nc)
        res, p = way(nc, b, path)
        if res:
            if(DEBUG): print("нашли!", p)
            return True, p
        else:
            if(DEBUG): print("откат...")
            path.pop()

    return False, path
    

showway("Тула", "Тула")
showway("Тверь", "Москва")
showway("Санкт-Петербург", "Тамбов")
showway("Минск", "Кострома")
showway("Одесса", "Владимир")
