#!/usr/bin/env python
# Mikhail (myke) Kolodin
# 2025-02-22 2025-02-22 1.0
# heavy-train.py

# ~ Товарняк

# ~ Есть товарный поезд. Известны массы всех вагонов. 
# ~ Он слишком тяжёлый. 
# ~ Надо его разделить пополам так, чтобы массы обеих частей были максимально близки.
# ~ Вагоны не переставляем, только расцепляем.

from random import randint


def make(numVagons: int = 10) -> list[int]:
    """сделать поезд"""

    MID = 50
    DIV = 20

    out = [ randint(MID-DIV, MID+DIV) for n in range(numVagons) ]

    return out


def test(vagons: list[int]) -> tuple[ list, list]:
    """разбить поезд на  2"""

    weiSum = 0
    allSum = sum(vagons)
    halfSum = allSum // 2

    for nVagon in range(len(vagons)):
        weiSum += vagons[nVagon]
        if weiSum >= halfSum:
            return vagons[:nVagon], vagons[nVagon:]


def run(times: int = 1) -> None:
    """тестируем"""

    for rept in range(1, times+1):
        print(f"\n------------------ тест {rept} ------------------\n")
        vags = make()
        print(f"поезд: {vags}")
        left, right = test(vags)
        print(f"левый поезд: {left}, вес: {sum(left)}")
        print(f"правый поезд: {right}, вес: {sum(right)}")


run(5)


# ~ ------------------ тест 1 ------------------

# ~ поезд: [41, 44, 36, 69, 40, 38, 45, 53, 44, 60]
# ~ левый поезд: [41, 44, 36, 69, 40], вес: 230
# ~ правый поезд: [38, 45, 53, 44, 60], вес: 240

# ~ ------------------ тест 2 ------------------

# ~ поезд: [49, 64, 40, 61, 39, 45, 41, 61, 36, 48]
# ~ левый поезд: [49, 64, 40, 61], вес: 214
# ~ правый поезд: [39, 45, 41, 61, 36, 48], вес: 270

# ~ ------------------ тест 3 ------------------

# ~ поезд: [55, 39, 66, 66, 57, 42, 63, 45, 38, 39]
# ~ левый поезд: [55, 39, 66, 66], вес: 226
# ~ правый поезд: [57, 42, 63, 45, 38, 39], вес: 284

# ~ ------------------ тест 4 ------------------

# ~ поезд: [55, 62, 62, 54, 64, 58, 59, 40, 50, 65]
# ~ левый поезд: [55, 62, 62, 54], вес: 233
# ~ правый поезд: [64, 58, 59, 40, 50, 65], вес: 336

# ~ ------------------ тест 5 ------------------

# ~ поезд: [65, 63, 58, 59, 50, 39, 49, 48, 36, 39]
# ~ левый поезд: [65, 63, 58, 59], вес: 245
# ~ правый поезд: [50, 39, 49, 48, 36, 39], вес: 261
