#!/usr/bin/env python

# Mikhail (myke) Kolodin, 2026
# kola-passes.py
# 2026-06-24 2026-06-24 1.1

# ~ перечисли хребты Кольского полуострова, укажи (list[json]):
# ~ - название,
# ~ - самую высокую точку,
# ~ - перевалы (json: название, высота, категория сложности (json: зимой, летом))

# -------------------------- данные -------------------------

data = [
  {
    "name": "Хибины",
    "highest_point": "Юдычвумчорр (1208 м)",
    "passes": [
      {
        "name": "Рамзая",
        "height": 743,
        "difficulty": {
          "winter": "н/к",
          "summer": "н/к"
        }
      },
      {
        "name": "Географов",
        "height": 842,
        "difficulty": {
          "winter": "1Б",
          "summer": "1А"
        }
      },
      {
        "name": "Кукисвумчорр",
        "height": 479,
        "difficulty": {
          "winter": "н/к",
          "summer": "н/к"
        }
      },
      {
        "name": "Западный Петрелиуса",
        "height": 843,
        "difficulty": {
          "winter": "1А",
          "summer": "н/к"
        }
      },
      {
        "name": "Восточный Арсеньева",
        "height": 1026,
        "difficulty": {
          "winter": "1А",
          "summer": "н/к"
        }
      },
      {
        "name": "Западный Арсеньева",
        "height": 1015,
        "difficulty": {
          "winter": "1Б",
          "summer": "1А"
        }
      },
      {
        "name": "Восточный Петрелиуса",
        "height": 883,
        "difficulty": {
          "winter": "1А",
          "summer": "н/к"
        }
      },
      {
        "name": "Чорргор Северный",
        "height": 1010,
        "difficulty": {
          "winter": "1Б",
          "summer": "1А"
        }
      },
      {
        "name": "Чорргор Южный",
        "height": 850,
        "difficulty": {
          "winter": "1А",
          "summer": "н/к"
        }
      },
      {
        "name": "Рисчорр Южный",
        "height": 895,
        "difficulty": {
          "winter": "1А",
          "summer": "н/к"
        }
      },
      {
        "name": "Рисчорр Северный",
        "height": 920,
        "difficulty": {
          "winter": "1Б",
          "summer": "1А"
        }
      },
      {
        "name": "Безымянный",
        "height": 830,
        "difficulty": {
          "winter": "1Б",
          "summer": "1А"
        }
      },
      {
        "name": "Умбозерский",
        "height": 515,
        "difficulty": {
          "winter": "н/к",
          "summer": "н/к"
        }
      },
      {
        "name": "Юкспорлак",
        "height": 662,
        "difficulty": {
          "winter": "1А",
          "summer": "н/к"
        }
      },
      {
        "name": "Ворткеуайв",
        "height": 756,
        "difficulty": {
          "winter": "н/к",
          "summer": "н/к"
        }
      },
      {
        "name": "Щель",
        "height": 630,
        "difficulty": {
          "winter": "1Б",
          "summer": "1А"
        }
      },
      {
        "name": "Аку-Аку",
        "height": 370,
        "difficulty": {
          "winter": "н/к",
          "summer": "н/к"
        }
      },
      {
        "name": "Южный Партомчорр",
        "height": 810,
        "difficulty": {
          "winter": "н/к",
          "summer": "н/к"
        }
      },
      {
        "name": "Северный Партомчорр",
        "height": 760,
        "difficulty": {
          "winter": "1А",
          "summer": "н/к"
        }
      },
      {
        "name": "Ферсмана",
        "height": 974,
        "difficulty": {
          "winter": "2А",
          "summer": "1Б"
        }
      },
      {
        "name": "Крестовый",
        "height": 940,
        "difficulty": {
          "winter": "2А",
          "summer": "1Б"
        }
      },
      {
        "name": "Орлиный",
        "height": 990,
        "difficulty": {
          "winter": "1Б",
          "summer": "1А"
        }
      },
      {
        "name": "Лопарский",
        "height": 960,
        "difficulty": {
          "winter": "1Б",
          "summer": "1А"
        }
      },
      {
        "name": "Тахтарвумчорр",
        "height": 980,
        "difficulty": {
          "winter": "1Б",
          "summer": "1А"
        }
      },
      {
        "name": "Южный Суолуайв",
        "height": 810,
        "difficulty": {
          "winter": "н/к",
          "summer": "н/к"
        }
      }
    ]
  }
]

# -------------------------- подготовка -------------------------

from pprint import pprint

# -------------------------- расчёт -------------------------

# ---------- тест 1 ----------

print("\n1. сколько всего перевалов?")

npass = sum( len(hreb['passes']) for hreb in data ) 

print(f"\nперевалов: {npass}")

# ---------- тест 2 ----------

print("\n2. опиши перевал Северный Чорргор")

for hreb in data:
    for apass in hreb['passes']:
        if apass['name'] == 'Чорргор Северный':
            print(f"""
Перевал:         Северный Чорргор
Высота:          {apass['height']}
Категория летом: {apass['difficulty']['summer']}
Категория зимой: {apass['difficulty']['winter']}
""")
            break

# -------------------------- результаты -------------------------

# ~ 1. сколько всего перевалов?

# ~ перевалов: 25

# ~ 2. опиши перевал Северный Чорргор

# ~ Перевал:         Северный Чорргор
# ~ Высота:          1010
# ~ Категория летом: 1А
# ~ Категория зимой: 1Б

# -------------------------- обсуждение -------------------------

# ~ Важные туристические пояснения

# ~ Категории сложности: Аббревиатура н/к означает «некатегорийный» перевал. Это простейшие маршруты, которые летом преодолеваются пешком по тропам или курумнику без специального снаряжения, а зимой — на лыжах. Категории 1А и 1Б требуют базовых навыков движения по крутым заснеженным или осыпным склонам.

# ~ Сезонная изменчивость: На Кольском полуострове зимняя сложность перевалов часто выше летней. Это связано с лавинной опасностью в узких ущельях, обледенением склонов и сильными ветрами на плато (традиционный лыжный сезон здесь длится с февраля по апрель).

# -------------------------- конец -------------------------
