#!/usr/bin/env python

# Mikhail (myke) Kolodin, 2025
# 2026-04-27 2026-04-27 1.0
# linearize.py

# ~ Линеаризация структуры.
# ~ Дана структура из данных простых типов, списков и кортежей,
# ~ возможно, сильно и неравномерно вложенных.
# ~ Преобразовать всё в линейный список.

s1 = 1,
s2 = 1, 2, 3
s3 = 1, 2, (31, 32, 33)
s4 = 1, None, True, (1.e5, 2e-10), [], (), "hello!", 0
s5 = [1, [2, [3, [4, [5, 55, 56], 44, 45], 30, 31], 20, (), 27, (28,), 222], 11]
s6 = ((((((((((1,),),),),),),),),),)

ss = s1, s2, s3, s4, s5, s6


def lin(s):
    out = []
    for e in s:
        if type(e) in (list, tuple):
            out.extend(lin(e))
        else:
            out.append(e)
    return out


def main():
    for s in ss:
        print(s, "=>", lin(s))


main()


# ~ result:
# ~ (1,) => [1]
# ~ (1, 2, 3) => [1, 2, 3]
# ~ (1, 2, (31, 32, 33)) => [1, 2, 31, 32, 33]
# ~ (1, None, True, (100000.0, 2e-10), [], (), 'hello!', 0) => [1, None, True, 100000.0, 2e-10, 'hello!', 0]
# ~ [1, [2, [3, [4, [5, 55, 56], 44, 45], 30, 31], 20, (), 27, (28,), 222], 11] => [1, 2, 3, 4, 5, 55, 56, 44, 45, 30, 31, 20, 27, 28, 222, 11]
# ~ ((((((((((1,),),),),),),),),),) => [1]
