#!/usr/bin/env python

# Mikhail (myke) Kolodin, 2022
# 2022-03-07 2022-03-07 1.0
# list-klass.py

# ~ Дан список вида 
# ~ klass = [[5, “Вася”], [4.1, “Коля”], [4.6, “Инна”], [3.9, “Фёдор”], [3.3, “Яков”], [4.8, “Гена”]]
# ~ со средними баллами учеников за четверть.
# ~ Показать 3 лучших и 3 худших из класса и их баллы.

klass = [[5, "Вася"], [4.1, "Коля"], [4.6, "Инна"],
    [3.9, "Фёдор"], [3.3, "Яков"], [4.8, "Гена"]]

klass.sort(reverse=True)

print("лучшие:", klass[:3], "\nхудшие:", klass[-3:][::-1])
