#!/usr/bin/env python

# Mikhail (myke) Kolodin, 2024
# max-triangle-many.py
# 2026-06-25 2026-06-25 2.2

# ~ Даны координаты несколькитх (3+) точек на плоскости.
# ~ Найти треугольнки с наибольшей площадью
# ~ (если несколько, то любой).

# ~ Решение:
# ~ 1. по itertools.combinations перебираем все возможные треугольники
# ~ 2. по кооринатам находим длины сторон, как гипотенузы по теореме Пифагора,
# ~ 3. затем периметр, полупериметр,
# ~ 4. и по формуле Герона находим площадь,
# ~ 5. затем выбираем наибольшую.

LIMIT = 4    # сколько всего точек делать

from math import sqrt
from pprint import pp
from random import random as rr

SCALE = 10.      # разбор данных (расстояние от нуля)

# ----------------------------------------------
# make random triangles

def rc():
    """
    дать случайную координату
    """

    return rr()*2*SCALE - SCALE
    

def make_tri():
    """
    сделать треугольники
    """

    trirandom = []
    
    for i in range(LIMIT):
        trirandom.append( (rc(), rc()) )

    return trirandom
    

# ----------------------------------------------
# prepare tests

def run_tests(tri):
    """
    выполнить тесты на наборе треугольников tri
    """

    print(f"\nТест на треугольниках:")
    for i, t in enumerate(tri, 1):
        print(f"треугольник номер {i}: ", end="")
        for el in t:
            print( "%.2f" % el , end=", " )
        print()
    for i in range(LIMIT):
        tri[i].append(calc_size(tri[i]))

    tri.sort(reverse=True, key = lambda x: x[-1])

    print(f"\nмакс. треугольник имеет размер {tri[0][-1]:.2f} и координаты ", end="")
    for el in tri[0][:-1]:
        print( "%.2f" % el , end=", " )
    print()


def calc_size(tri):
    """
    вычислить размер одного треугольника
    """

    a = length(tri[0], tri[1], tri[2], tri[3])
    b = length(tri[4], tri[5], tri[2], tri[3])
    c = length(tri[4], tri[5], tri[0], tri[1])

    p = (a + b + c) / 2

    s = sqrt( p * (p-a) * (p-b) * (p-c) )

    return s


def length(x1, y1, x2, y2):
    """
    вычислить длину стороны
    """

    size = sqrt( (x1-x2) ** 2 + (y1-y2) ** 2 )

    return size
    

# ----------------------------------------------
# run all

from itertools import combinations

def main():
    """
    запустить всё
    """

    points = make_tri()
    print(f"{points=}")

    sq = 0.
    btri = []
    for tri in combinations(points, 3):
        print("треугольник:\n", tri)
        trix = ( tri[0][0], tri[0][1], tri[1][0], tri[1][1], tri[2][0], tri[2][1])
        print(trix)
        cs = calc_size(trix)
        # ~ cs = 0.
        if cs > sq:
            sq = cs
            btri = tri
            print("нашли получше!")
        print("эта площадь:  ", cs)
        print("макс. площадь:", sq)        
        
    print("\nмаксимальный треугольник с площадью:", sq)
    print(btri)
    print()

main()

# ----------------------------------------------
# test for itertools

# ~ def tit():
    # ~ """
    # ~ проверка комбинаций
    # ~ """

    # ~ var = 11, 22, 33, 44
    # ~ for c in combinations(var, 3):
        # ~ print(c)

# ~ tit()

# ----------------------------------------------
# results

# ~ points=[(4.770036893713247, -3.1337006839122283), (-2.6505124797171327, -9.360540100888475), (-1.8139728242805742, -1.6304743254418685), (2.569912424404233, 7.676439140990375)]
# ~ треугольник:
 # ~ ((4.770036893713247, -3.1337006839122283), (-2.6505124797171327, -9.360540100888475), (-1.8139728242805742, -1.6304743254418685))
# ~ (4.770036893713247, -3.1337006839122283, -2.6505124797171327, -9.360540100888475, -1.8139728242805742, -1.6304743254418685)
# ~ нашли получше!
# ~ эта площадь:   26.076168323114917
# ~ макс. площадь: 26.076168323114917
# ~ треугольник:
 # ~ ((4.770036893713247, -3.1337006839122283), (-2.6505124797171327, -9.360540100888475), (2.569912424404233, 7.676439140990375))
# ~ (4.770036893713247, -3.1337006839122283, -2.6505124797171327, -9.360540100888475, 2.569912424404233, 7.676439140990375)
# ~ нашли получше!
# ~ эта площадь:   46.958499036061596
# ~ макс. площадь: 46.958499036061596
# ~ треугольник:
 # ~ ((4.770036893713247, -3.1337006839122283), (-1.8139728242805742, -1.6304743254418685), (2.569912424404233, 7.676439140990375))
# ~ (4.770036893713247, -3.1337006839122283, -1.8139728242805742, -1.6304743254418685, 2.569912424404233, 7.676439140990375)
# ~ эта площадь:   33.933390282924925
# ~ макс. площадь: 46.958499036061596
# ~ треугольник:
 # ~ ((-2.6505124797171327, -9.360540100888475), (-1.8139728242805742, -1.6304743254418685), (2.569912424404233, 7.676439140990375))
# ~ (-2.6505124797171327, -9.360540100888475, -1.8139728242805742, -1.6304743254418685, 2.569912424404233, 7.676439140990375)
# ~ эта площадь:   13.051059569978316
# ~ макс. площадь: 46.958499036061596

# ~ максимальный треугольник с площадью: 46.958499036061596
# ~ ((4.770036893713247, -3.1337006839122283), (-2.6505124797171327, -9.360540100888475), (2.569912424404233, 7.676439140990375))

# ----------------------------------------------
