#!/usr/bin/env python
# Mikhail (myke) Kolodin
# max_pair_all.py
# 2025-04-03 2025-04-03 1.1

# ~ Есть несколько наборов натуральных чисел, записанных построчно.
# ~ Определить пару чисел (среди всех заданных наборов), дающих максимальное произведение.
# ~ (Если наборов нет, сообщить.)

# ------------------------------------------------
# 1 способ задания исходных данных: явное перечисление

data = """
15 45 22 456 34 77 22 455 666
789 45 239 843
5678 12 34 56 789
998 665 221
"""

# ------------------------------------------------
# 2 способ задания исходных данных: пустой набор, для проверки

# ~ data = ""

# ------------------------------------------------
# 3 способ задания исходных данных: случайные числа

import random

num_of_groups = random.randint(3, 9)
nums_in_a_group = random.randint(3, 9)
max_val = 99

def make_data():
    """подготовить наборы"""

    data = []

    for row in range(random.randint(2, num_of_groups)):
        data.append( ' ' .join( [ str(random.randint(1, max_val))
            for _ in range(random.randint(1, nums_in_a_group)) ] ) )

    data = '\n' .join(data)

    return data

# ~ data = make_data()

# ------------------------------------------------
# решалка:    

def solve():
    """решить всё"""

    numbers = data.split()

    assert len(numbers) >= 2, "Должны быть указаны числа, причём не менее двух!"

    left, right = sorted(list(map(int, numbers)), reverse=True)[:2]

    print(f"Максимальное произведение равно {left * right:_} для чисел {left:_} и {right:_}")


solve()

# ------------------------------------------------

# ~ Максимальное произведение равно 5_666_644 для чисел 5_678 и 998
