#!/usr/bin/env python

# Mikhail (myke) Kolodin, 2022
# 2022-05-03 2024-10-28 1.1
# maxpair.py

# ~ пользователь вводит строку натуральных чисел.
# ~ программа находит пару, дающую макс. произведение.
# ~ так повторяется, пока пользователь не введёт пустую строку или 0.

def test()1 2+:
    while (s := input("введите строку натуральных чисел через пробелы или 0 для окончания: ")):
        nums = s.strip().split()
        nums = list(map(int, nums))
        # ~ nums = [int(x) for x in nums]
        print("числа:", nums)

test()


# ~ пример работы

# ~ -------------- 1 раз -------------------

# ~ [[3, 4, 1, 2, 2, 6, 3, 1, 7, 7],
 # ~ [9, 4, 5, 2, 7, 1, 1, 0, 0, 5],
 # ~ [6, 4, 7, 2, 5, 6, 2, 1, 9, 3],
 # ~ [5, 4, 6, 8, 0, 4, 1, 8, 6, 9],
 # ~ [9, 7, 3, 4, 1, 2, 8, 1, 2, 8],
 # ~ [6, 7, 4, 5, 7, 5, 8, 3, 3, 6],
 # ~ [0, 8, 4, 1, 5, 3, 4, 4, 1, 0],
 # ~ [8, 3, 1, 2, 9, 5, 0, 1, 0, 3],
 # ~ [0, 7, 3, 0, 2, 5, 8, 2, 6, 7],
 # ~ [1, 2, 7, 2, 3, 2, 4, 6, 8, 4]]

# ~ лучшая сумма 29 в квадрате с вершиной 4 и 0
