#!/usr/bin/env python
# myke 2026-06-25 2026-06-25 1.0
# num-solve.py

# ~ Дана возрастающая функция (напр., f(x) = ln(x-e)).
# ~ Численно найти её единственный корень.
# ~ Диапазон (по умолчанию): (0; 100)

from math import e, pi, log

def fun(x):
    """спецфункция"""
    return log(x-e)

for i in range(30, 50):
    print(i/10., fun(i/10.))
    
# ~ 3.0 -1.2668480994676237
# ~ 3.1 -0.9630727134975926
# ~ 3.2 -0.7303960422855215
# ~ 3.3 -0.5417691898719655
# ~ 3.4 -0.3831389447548572
# ~ 3.5 -0.24626099784341954
# ~ 3.6 -0.12588280743729804
# ~ 3.7 -0.01845100617591252
# ~ 3.8 0.07855067657092671
# ~ 3.9 0.1669694570016161
# ~ 4.0 0.2482014993397698
# ~ 4.1 0.3233277765760816
# ~ 4.2 0.39320234113855723
# ~ 4.3 0.45851170653543316
# ~ 4.4 0.5198159919475187
# ~ 4.5 0.5775781636460426
# ~ 4.6 0.6321852805027308
# ~ 4.7 0.6839642318219743
# ~ 4.8 0.7331935967367147
# ~ 4.9 0.780112718455251

def solve(fun, xfrom=0., xto=100.):
    """решить численно"""

    EPS = 1e-6

    assert fun(xfrom) < 0., "левая граница плохая"
    assert fun(xto) > 0., "правая граница плохая"

    LREPT = 1000
    rept = 0

    while (abs(xto - xfrom) >= EPS):
        rept += 1
        assert rept < LREPT, "превышено число итераций"

        point = xfrom + (xto - xfrom) / 2.
        print(f"{rept=}, {point=}")

        fv = fun(point)

        if fv < 0.:
            xfrom = point
        else:
            xto = point

        print(f"{xfrom=}, {xto=}")

    return xfrom


print(solve(fun, 3., 5.))


# ~ rept=1, point=4.0
# ~ xfrom=3.0, xto=4.0
# ~ rept=2, point=3.5
# ~ xfrom=3.5, xto=4.0
# ~ rept=3, point=3.75
# ~ xfrom=3.5, xto=3.75
# ~ rept=4, point=3.625
# ~ xfrom=3.625, xto=3.75
# ~ rept=5, point=3.6875
# ~ xfrom=3.6875, xto=3.75
# ~ rept=6, point=3.71875
# ~ xfrom=3.6875, xto=3.71875
# ~ rept=7, point=3.703125
# ~ xfrom=3.703125, xto=3.71875
# ~ rept=8, point=3.7109375
# ~ xfrom=3.7109375, xto=3.71875
# ~ rept=9, point=3.71484375
# ~ xfrom=3.71484375, xto=3.71875
# ~ rept=10, point=3.716796875
# ~ xfrom=3.716796875, xto=3.71875
# ~ rept=11, point=3.7177734375
# ~ xfrom=3.7177734375, xto=3.71875
# ~ rept=12, point=3.71826171875
# ~ xfrom=3.71826171875, xto=3.71875
# ~ rept=13, point=3.718505859375
# ~ xfrom=3.71826171875, xto=3.718505859375
# ~ rept=14, point=3.7183837890625
# ~ xfrom=3.71826171875, xto=3.7183837890625
# ~ rept=15, point=3.71832275390625
# ~ xfrom=3.71826171875, xto=3.71832275390625
# ~ rept=16, point=3.718292236328125
# ~ xfrom=3.71826171875, xto=3.718292236328125
# ~ rept=17, point=3.7182769775390625
# ~ xfrom=3.7182769775390625, xto=3.718292236328125
# ~ rept=18, point=3.7182846069335938
# ~ xfrom=3.7182769775390625, xto=3.7182846069335938
# ~ rept=19, point=3.718280792236328
# ~ xfrom=3.718280792236328, xto=3.7182846069335938
# ~ rept=20, point=3.718282699584961
# ~ xfrom=3.718280792236328, xto=3.718282699584961
# ~ rept=21, point=3.7182817459106445
# ~ xfrom=3.7182817459106445, xto=3.718282699584961
# ~ 3.7182817459106445
