#!/usr/bin/env python

# Mikhail (myke) Kolodin, 2021
# 2021-11-13 2021-11-13 1.0
# o-panets.py

# олимпиада идёт 3 часаа.
# до каких планет за это время дойдёт свет от Солнца?
# ответ: до всех, кроме Нептуна

# всё считаем в км и с (секундах)

print ("=" * 80, "\nсвет до планет", "\n" + "=" * 80)

# скорость света 300_000 km/s
LIGHT = 300000
print ("скорость света %1.2e км/с" % LIGHT)

# a.e.
AE = 149597870.700
print ("а.е. равна %5.2e м" % AE)

# до земли
toearth = AE / LIGHT
print ("до Земли свет идёт %5.2e c = %5.2e мин" % (toearth, toearth / 60))

# продолжительность олимпиады
dur = 3 * 60 * 60
print ("продолжительность олимпиады: %5.2e с = %5.2e мин" % (dur, dur / 60))

# сколько пройдёт свет
dist = LIGHT * dur
print ("свет прошёл за %5.2e с путь %5.2e km" % (dur, dist))

# расстояния от Солнца до планет
planets = {
    "mercury":   0.38 * AE,
    "venus":     0.72 * AE,
    "earth":     AE,
    "mars":      1.52 * AE,
    "jupiter":   5.2 * AE,
    "saturn":    9.545 * AE,
    "uran":      19.22 * AE,
    "neptun":    30.06 * AE
    }

for planet, radius in planets.items():
    t_light_s = radius / LIGHT
    t_light_m = t_light_s / 60
    print ("планета:", planet,
        ", \tорб. радиус: %5.2e km" % radius,
        ", \tвремя для света: %5.2e s" % t_light_s,
        "\t= %5.2e" % t_light_m,
        "мин, \tуспех:", t_light_s < dur)

# ================================================================================
# свет до планет
# ================================================================================
# скорость света 3.00e+05 км/с
# а.е. равна 1.50e+08 м
# до Земли свет идёт 4.99e+02 c = 8.31e+00 мин
# продолжительность олимпиады: 1.08e+04 с = 1.80e+02 мин
# свет прошёл за 1.08e+04 с путь 3.24e+09 km
# планета: mercury ,    орб. радиус: 5.68e+07 km ,  время для света: 1.89e+02 s     = 3.16e+00 мин,     успех: True
# планета: venus ,  орб. радиус: 1.08e+08 km ,  время для света: 3.59e+02 s     = 5.98e+00 мин,     успех: True
# планета: earth ,  орб. радиус: 1.50e+08 km ,  время для света: 4.99e+02 s     = 8.31e+00 мин,     успех: True
# планета: mars ,   орб. радиус: 2.27e+08 km ,  время для света: 7.58e+02 s     = 1.26e+01 мин,     успех: True
# планета: jupiter ,    орб. радиус: 7.78e+08 km ,  время для света: 2.59e+03 s     = 4.32e+01 мин,     успех: True
# планета: saturn ,     орб. радиус: 1.43e+09 km ,  время для света: 4.76e+03 s     = 7.93e+01 мин,     успех: True
# планета: uran ,   орб. радиус: 2.88e+09 km ,  время для света: 9.58e+03 s     = 1.60e+02 мин,     успех: True
# планета: neptun ,     орб. радиус: 4.50e+09 km ,  время для света: 1.50e+04 s     = 2.50e+02 мин,     успех: False
