#!/usr/bin/env python

# Mikhail (myke) Kolodin, 2021
# 2022-01-21 2022-01-21 0.1
# overlap.py

# ~ бывает, что конец одного слова совпадает с началом другого слова.
# ~ тогда слова можно наложить друг на друга.

# ~ напр.,
# ~ аспирант + антенна = аспирантенна

# ~ среди заданных пар слов найти самые длинные наложения
# ~ (пар слов - несколько, порядок слов проивольный)

data = """
аспирант антенна
пират вампир
"""

def obepary(s1, s2):
    para (s1, s2)
    para (s2, s1)

def para (s1, s2):
    ...

def stroka (s):
    s = strip()
    if s:
        print ("\nстрока:", s)
        obepary (s.split())
    
