#!/usr/bin/env python

# Mikhail (myke) Kolodin, 2021
# 2025-05-17 2025-05-19 1.1
# palin-hours.py
# ~ Палиндром времени
# ~ Сколько раз в сутки время HH:MM:SS даёт палиндром?
# ~ Если бы время было десятичным, то 1000.
# ~ (Напр., если бы везде победили Великая французская революция...)
# ~ А так - ?


def work():

    cnt = 0
    for hours in range(24):
        for minutes in range(60):
            for seconds in range(60):
                stroka = f"{hours:02}{minutes:02}{seconds:02}"
                revstroka = stroka[::-1]
                if stroka == revstroka:
                    cnt += 1
                    print(f"палиндром: {stroka}")

    print(f"\nвсего палиндромов времени в сутках: {cnt}")


work()

# ~ палиндром: 000000
# ~ палиндром: 001100
# ~ палиндром: 002200
# ~ палиндром: 003300
# ~ палиндром: 004400
# ~ палиндром: 005500
# ~ палиндром: 010010
# ~ палиндром: 011110
# ~ палиндром: 012210
# ~ палиндром: 013310
# ~ палиндром: 014410
# ~ палиндром: 015510
# ~ палиндром: 020020
# ~ палиндром: 021120
# ~ палиндром: 022220
# ~ палиндром: 023320
# ~ палиндром: 024420
# ~ палиндром: 025520
# ~ палиндром: 030030
# ~ палиндром: 031130
# ~ палиндром: 032230
# ~ палиндром: 033330
# ~ палиндром: 034430
# ~ палиндром: 035530
# ~ палиндром: 040040
# ~ палиндром: 041140
# ~ палиндром: 042240
# ~ палиндром: 043340
# ~ палиндром: 044440
# ~ палиндром: 045540
# ~ палиндром: 050050
# ~ палиндром: 051150
# ~ палиндром: 052250
# ~ палиндром: 053350
# ~ палиндром: 054450
# ~ палиндром: 055550
# ~ палиндром: 100001
# ~ палиндром: 101101
# ~ палиндром: 102201
# ~ палиндром: 103301
# ~ палиндром: 104401
# ~ палиндром: 105501
# ~ палиндром: 110011
# ~ палиндром: 111111
# ~ палиндром: 112211
# ~ палиндром: 113311
# ~ палиндром: 114411
# ~ палиндром: 115511
# ~ палиндром: 120021
# ~ палиндром: 121121
# ~ палиндром: 122221
# ~ палиндром: 123321
# ~ палиндром: 124421
# ~ палиндром: 125521
# ~ палиндром: 130031
# ~ палиндром: 131131
# ~ палиндром: 132231
# ~ палиндром: 133331
# ~ палиндром: 134431
# ~ палиндром: 135531
# ~ палиндром: 140041
# ~ палиндром: 141141
# ~ палиндром: 142241
# ~ палиндром: 143341
# ~ палиндром: 144441
# ~ палиндром: 145541
# ~ палиндром: 150051
# ~ палиндром: 151151
# ~ палиндром: 152251
# ~ палиндром: 153351
# ~ палиндром: 154451
# ~ палиндром: 155551
# ~ палиндром: 200002
# ~ палиндром: 201102
# ~ палиндром: 202202
# ~ палиндром: 203302
# ~ палиндром: 204402
# ~ палиндром: 205502
# ~ палиндром: 210012
# ~ палиндром: 211112
# ~ палиндром: 212212
# ~ палиндром: 213312
# ~ палиндром: 214412
# ~ палиндром: 215512
# ~ палиндром: 220022
# ~ палиндром: 221122
# ~ палиндром: 222222
# ~ палиндром: 223322
# ~ палиндром: 224422
# ~ палиндром: 225522
# ~ палиндром: 230032
# ~ палиндром: 231132
# ~ палиндром: 232232
# ~ палиндром: 233332
# ~ палиндром: 234432
# ~ палиндром: 235532

# ~ всего палиндромов времени в сутках: 96
