#!/usr/bin/env python

# Mikhail (myke) Kolodin, 2021
# 2025-05-17 2025-05-23 1.2
# palin-hours.py
# ~ Палиндром времени
# ~ Сколько раз в сутки время HH:MM:SS даёт палиндром?
# ~ Если бы время было десятичным, то 1000.
# ~ (Напр., если бы везде победила Великая французская революция...)
# ~ А так - ?


def work():

    cnt = 0
    for hours in range(24):
        for minutes in range(60):
            for seconds in range(60):
                stroka = f"{hours:02}:{minutes:02}:{seconds:02}"
                revstroka = stroka[::-1]
                if stroka == revstroka:
                    cnt += 1
                    print(f"палиндром: {stroka}")

    print(f"\nвсего палиндромов времени в сутках: {cnt}")


work()

# ~ палиндром: 00:00:00
# ~ палиндром: 00:11:00
# ~ палиндром: 00:22:00
# ~ палиндром: 00:33:00
# ~ палиндром: 00:44:00
# ~ палиндром: 00:55:00
# ~ палиндром: 01:00:10
# ~ палиндром: 01:11:10
# ~ палиндром: 01:22:10
# ~ палиндром: 01:33:10
# ~ палиндром: 01:44:10
# ~ палиндром: 01:55:10
# ~ палиндром: 02:00:20
# ~ палиндром: 02:11:20
# ~ палиндром: 02:22:20
# ~ палиндром: 02:33:20
# ~ палиндром: 02:44:20
# ~ палиндром: 02:55:20
# ~ палиндром: 03:00:30
# ~ палиндром: 03:11:30
# ~ палиндром: 03:22:30
# ~ палиндром: 03:33:30
# ~ палиндром: 03:44:30
# ~ палиндром: 03:55:30
# ~ палиндром: 04:00:40
# ~ палиндром: 04:11:40
# ~ палиндром: 04:22:40
# ~ палиндром: 04:33:40
# ~ палиндром: 04:44:40
# ~ палиндром: 04:55:40
# ~ палиндром: 05:00:50
# ~ палиндром: 05:11:50
# ~ палиндром: 05:22:50
# ~ палиндром: 05:33:50
# ~ палиндром: 05:44:50
# ~ палиндром: 05:55:50
# ~ палиндром: 10:00:01
# ~ палиндром: 10:11:01
# ~ палиндром: 10:22:01
# ~ палиндром: 10:33:01
# ~ палиндром: 10:44:01
# ~ палиндром: 10:55:01
# ~ палиндром: 11:00:11
# ~ палиндром: 11:11:11
# ~ палиндром: 11:22:11
# ~ палиндром: 11:33:11
# ~ палиндром: 11:44:11
# ~ палиндром: 11:55:11
# ~ палиндром: 12:00:21
# ~ палиндром: 12:11:21
# ~ палиндром: 12:22:21
# ~ палиндром: 12:33:21
# ~ палиндром: 12:44:21
# ~ палиндром: 12:55:21
# ~ палиндром: 13:00:31
# ~ палиндром: 13:11:31
# ~ палиндром: 13:22:31
# ~ палиндром: 13:33:31
# ~ палиндром: 13:44:31
# ~ палиндром: 13:55:31
# ~ палиндром: 14:00:41
# ~ палиндром: 14:11:41
# ~ палиндром: 14:22:41
# ~ палиндром: 14:33:41
# ~ палиндром: 14:44:41
# ~ палиндром: 14:55:41
# ~ палиндром: 15:00:51
# ~ палиндром: 15:11:51
# ~ палиндром: 15:22:51
# ~ палиндром: 15:33:51
# ~ палиндром: 15:44:51
# ~ палиндром: 15:55:51
# ~ палиндром: 20:00:02
# ~ палиндром: 20:11:02
# ~ палиндром: 20:22:02
# ~ палиндром: 20:33:02
# ~ палиндром: 20:44:02
# ~ палиндром: 20:55:02
# ~ палиндром: 21:00:12
# ~ палиндром: 21:11:12
# ~ палиндром: 21:22:12
# ~ палиндром: 21:33:12
# ~ палиндром: 21:44:12
# ~ палиндром: 21:55:12
# ~ палиндром: 22:00:22
# ~ палиндром: 22:11:22
# ~ палиндром: 22:22:22
# ~ палиндром: 22:33:22
# ~ палиндром: 22:44:22
# ~ палиндром: 22:55:22
# ~ палиндром: 23:00:32
# ~ палиндром: 23:11:32
# ~ палиндром: 23:22:32
# ~ палиндром: 23:33:32
# ~ палиндром: 23:44:32
# ~ палиндром: 23:55:32

# ~ всего палиндромов времени в сутках: 96
