#!/usr/bin/env python
# Mikhail Kolodin, 2024
# papersizes.py
# 2024-10-22 2024-10-22 1.0

# ~ Размер стандартного листа бумаги A4 равен 210 х 297 мм.
# ~ Большие (А3, А2, А1, А0) и меньшие (А5, А6, до А10) размеры получаются, соответственно,
# ~ увеличеним или уменьшением листа вдоль длинной стороны.
# ~ Распечатать все размеры.

A4 = [210, 297]

A3 = sorted([2 * min(A4), max(A4)])

A2 = sorted([2 * min(A3), max(A3)])

A1 = sorted([2 * min(A2), max(A2)])

A5 = sorted([min(A4), max(A4) // 2])

A6 = sorted([min(A5), max(A5) // 2])

print(f"{A1=}, {A2=}, {A3=}, {A4=}, {A5=}, {A6=}")

# ~ A1=[594, 840], A2=[420, 594], A3=[297, 420], A4=[210, 297], A5=[148, 210], A6=[105, 148]
