#!/usr/bin/env python
# myke 2022-05-16 2022-05-16 1.0
# parrots_data.py 

# речи попугаев

parrots = {

"alisa": 
    """Послушайте все - ого-го! эге-гей!
Меня, Попугая - пирата морей!
Родился я в тыща каком-то году
В банано-лиановой чаще
Мой папа был папа-пугай какаду
Тогда еще не говорящий
Но вскоре покинул я девственный лес
Взял в плен меня страшный Фернандо Кортес
Он начал на бедного папу кричать
А папа Фернанде не мог отвечать
Не мог, не умел отвечать
И начал я плавать на разных судах
В районе Экватора, в северных льдах
Давали мне кофе, какао, еду
Чтоб я их приветствовал: "Хау ду ю ду!"
Но я повторял от зари до зари
"Карамба!" "Коррида!" и "Чёрт побери!"
Семь лет я проплавал по морю, и что ж?
Какой-то матросик пропавший
Продал меня в рабство за ломаный грош
А я уже был говорящий
Турецкий паша нож сломал пополам
Когда я сказал ему: "Паша, салам!"
И просто кондрашка хватила пашу
Когда он узнал, что еще я пишу
Читаю, пою и пляшу
Я Индию видел, Китай и Ирак
Я - индивидуум, не попка-дурак
Так думают только одни дикари
"Карамба!" "Коррида!" и "Чёрт побери!"
"""
,

"foton":
    """  — Тр-руп! — — Цер-ремония! Тр-руп за борт! Р-рубидий!
       — Р-рубидий! Резер-рв! Огр-ромен! 
    — Тр-ройка!
    — Тр-ройка! Кр-руче впр-раво! Смер-рч! Смер-рч!
     — Огр-ромен! Гр-руды! Гр-руды! Р-ричи пр-рав! Р-ричи пр-рав! Р-роботы! Р-роботы!
     — Роботы!
    — Кр-рах! Гор-рят! Атмосфер-ра гор-рит! Пр-рочь! Др-рамба, пр-рочь!
    — Драмба!
    — Р-рубидий! Р-резерв!
    — Рубидий!
    — Р-резерв! Кр-ратер Р-ричи!
    — Пер-рехожу на пр-рием! — — Чар-родей! Чар-родей! Говор-рит Кр-рыло, говор-рит Кр-рыло!
     — Цер-ремония погр-ребения! Вр-ремя огр-раничено! Р-речь! Р-речь! Тр-репотня! Р-работать! Р-работать!
     — Кор-рнеев гр-руб! Гр-руб! Пр-рекрасный р-работник! Дур-рак р-редкий! Пр-релесть! 
     — Кор-рнеев, пр-рошу!
    — Кр-рематорий! Безвр-ременно обор-рвалась! 
    — Ампер-рметр!
    "Др-рамба игнор-рирует ур-ран", "Пр-равильно", и "Кор-рнеев гр-руб"
"""
,

"taiti":
    """— Таити, Таити... Не были мы ни на каком Таити. Нас и здесь неплохо кормят...
"""
,

"silver":
    """Пиастры! Пиастры! Пиастры!
    """
,

"gumilev":
    """
    Я — попугай с Антильских островов,
Но я живу в квадратной келье мага.
Вокруг — реторты, глобусы, бумага,
И кашель старика, и бой часов.

Пусть в час заклятий, в вихре голосов
И в блеске глаз, мерцающих как шпага,
Ерошат крылья ужас и отвага
И я сражаюсь с призраками сов…

Пусть! Но едва под этот свод унылый
Войдет гадать о картах иль о милой
Распутник в раззолоченном плаще, —

Мне грезится корабль в тиши залива,
Я вспоминаю солнце… и вотще
Стремлюсь забыть, что тайна некрасива.
"""
}
