#!/usr/bin/env python

# Mikhail (myke) Kolodin, 2026
# pop-coef.py
# 2026-06-24 2026-06-24 1.0

# ~ изучаем население мира, покажи (dict[dict]) такое для каждой страны мира из 50 самых населённых (всё по-англ.):
# ~ - name; название страны,
# ~ - pop: население (тыс. чел.),
# ~ - add: прирост населения (тыс. чел.) за 5 лет (возможно, отрицательный),
# ~ - coef: коэффициент рождаемости;
# ~ вывод вложенного словаря сделай в 1 строку, ключ внешнего словаря - название страны

# -------------------------- данные -------------------------

data = {
  "India": {"pop": 1476625, "add": 61200, "coef": 2.0},
  "China": {"pop": 1412914, "add": -11800, "coef": 1.2},
  "United States": {"pop": 349035, "add": 9400, "coef": 1.7},
  "Indonesia": {"pop": 287886, "add": 11800, "coef": 2.1},
  "Pakistan": {"pop": 259299, "add": 24200, "coef": 3.3},
  "Nigeria": {"pop": 242431, "add": 26100, "coef": 5.0},
  "Brazil": {"pop": 213562, "add": 4900, "coef": 1.6},
  "Bangladesh": {"pop": 177818, "add": 8100, "coef": 1.9},
  "Russia": {"pop": 143200, "add": -2900, "coef": 1.5},
  "Ethiopia": {"pop": 138879, "add": 17100, "coef": 3.8},
  "Mexico": {"pop": 132997, "add": 5050, "coef": 1.8},
  "Japan": {"pop": 122427, "add": -3400, "coef": 1.3},
  "Egypt": {"pop": 118200, "add": 9100, "coef": 2.7},
  "Philippines": {"pop": 117900, "add": 7500, "coef": 2.4},
  "DR Congo": {"pop": 112100, "add": 15800, "coef": 6.0},
  "Vietnam": {"pop": 101900, "add": 3600, "coef": 1.9},
  "Iran": {"pop": 92300, "add": 2900, "coef": 1.7},
  "Turkey": {"pop": 86300, "add": 2400, "coef": 1.6},
  "Germany": {"pop": 83400, "add": 200, "coef": 1.5},
  "Tanzania": {"pop": 72563, "add": 8900, "coef": 4.6},
  "Thailand": {"pop": 71559, "add": -290, "coef": 1.3},
  "United Kingdom": {"pop": 69931, "add": 1750, "coef": 1.6},
  "France": {"pop": 68900, "add": 850, "coef": 1.7},
  "South Africa": {"pop": 61500, "add": 3100, "coef": 2.3},
  "Italy": {"pop": 58965, "add": -750, "coef": 1.3},
  "Kenya": {"pop": 57100, "add": 5400, "coef": 3.3},
  "Myanmar": {"pop": 55200, "add": 1400, "coef": 2.1},
  "Colombia": {"pop": 53936, "add": 2100, "coef": 1.7},
  "Sudan": {"pop": 53282, "add": 5900, "coef": 4.5},
  "Uganda": {"pop": 52761, "add": 6400, "coef": 4.8},
  "South Korea": {"pop": 51600, "add": -220, "coef": 0.7},
  "Spain": {"pop": 47900, "add": 600, "coef": 1.3},
  "Algeria": {"pop": 46800, "add": 3300, "coef": 2.8},
  "Iraq": {"pop": 46500, "add": 4900, "coef": 3.4},
  "Argentina": {"pop": 46200, "add": 1900, "coef": 1.9},
  "Afghanistan": {"pop": 44300, "add": 5100, "coef": 4.5},
  "Yemen": {"pop": 35300, "add": 3500, "coef": 3.6},
  "Canada": {"pop": 42100, "add": 3600, "coef": 1.4},
  "Poland": {"pop": 40200, "add": -500, "coef": 1.3},
  "Morocco": {"pop": 38400, "add": 1800, "coef": 2.3},
  "Angola": {"pop": 38300, "add": 4900, "coef": 5.2},
  "Ukraine": {"pop": 37200, "add": -4800, "coef": 1.1},
  "Uzbekistan": {"pop": 37100, "add": 3200, "coef": 2.8},
  "Saudi Arabia": {"pop": 37000, "add": 2100, "coef": 2.2},
  "Peru": {"pop": 34900, "add": 1600, "coef": 2.2},
  "Malaysia": {"pop": 34600, "add": 1800, "coef": 1.8},
  "Ghana": {"pop": 34500, "add": 3600, "coef": 3.6},
  "Mozambique": {"pop": 34300, "add": 4300, "coef": 4.7},
  "Nepal": {"pop": 31400, "add": 1400, "coef": 1.9},
  "Madagascar": {"pop": 31200, "add": 3500, "coef": 3.9}
}

# -------------------------- подготовка -------------------------

from pprint import pprint

# -------------------------- расчёт -------------------------

# ---------- тест 1 ----------

print('\n1. сколько стран?')

print(f"всего стран: {len(data)}")

# ---------- тест 2 ----------

print('\n2. опиши Россию')

land = data['Russia']

# ~ pprint(land)

print(f"""
страна:       Россия
население:    {land['pop']} тыс.чел.
прирост:      {land['add']} тыс.чел.
коэффициент:  {land['coef']} 
""")

# -------------------------- результаты -------------------------

# ~ 1. сколько стран?
# ~ всего стран: 50

# ~ 2. опиши Россию

# ~ страна:       Россия
# ~ население:    143200 тыс.чел.
# ~ прирост:      -2900 тыс.чел.
# ~ коэффициент:  1.5 

# -------------------------- обсуждение -------------------------


# -------------------------- конец -------------------------
print()
