#!/usr/bin/env python

# Mikhail (myke) Kolodin, 2026
# predatots.py
# 2026-06-27 2026-06-27 1.0

# ~ Изучаем животный мир регионов (region): Сибирь, Дальний Восток, Урал, европейская часть России. Какие есть животные (animals): хищные (predators), прочие (other), и птицы (birds): хищные, прочие ? Перечисли основные виды для каждого региона. Формат: lsit[dict], ключи англ., значения рус.

# -------------------------- данные -------------------------

data1 = [
  {
    "region": "Сибирь",
    "animals": {
      "predators": [
        "Бурый медведь",
        "Соболь",
        "Росомаха",
        "Рысь",
        "Волк"
      ],
      "other": [
        "Лось",
        "Кабарга",
        "Северный олень",
        "Азиатский бурундук",
        "Заяц-беляк"
      ]
    },
    "birds": {
      "predators": [
        "Филин",
        "Беркут",
        "Орлан-белохвост",
        "Бородатая неясыть"
      ],
      "other": [
        "Глухарь",
        "Рябчик",
        "Кедровка",
        "Кукша"
      ]
    }
  },
  {
    "region": "Дальний Восток",
    "animals": {
      "predators": [
        "Амурский тигр",
        "Дальневосточный леопард",
        "Гималайский медведь",
        "Харза",
        "Енотовидная собака"
      ],
      "other": [
        "Пятнистый олень",
        "Изюбрь",
        "Горал",
        "Японская мышь"
      ]
    },
    "birds": {
      "predators": [
        "Белоплечий орлан",
        "Рыбный филин",
        "Ястребиный сарыч"
      ],
      "other": [
        "Мандаринка",
        "Японский журавль",
        "Даурский журавль",
        "Дикуша"
      ]
    }
  },
  {
    "region": "Урал",
    "animals": {
      "predators": [
        "Бурый медведь",
        "Рысь",
        "Лесная куница",
        "Корсак",
        "Волк"
      ],
      "other": [
        "Лось",
        "Косуля",
        "Кабан",
        "Бобр",
        "Белка-летяга"
      ]
    },
    "birds": {
      "predators": [
        "Степной орел",
        "Мохноногий канюк",
        "Длиннохвостая неясыть"
      ],
      "other": [
        "Тетерев",
        "Глухарь",
        "Серая куропатка",
        "Трёхпалый дятел"
      ]
    }
  },
  {
    "region": "Европейская часть России",
    "animals": {
      "predators": [
        "Лисица",
        "Волк",
        "Лесной хорек",
        "Ласка",
        "Барсук"
      ],
      "other": [
        "Европейский олень",
        "Косуля",
        "Заяц-русак",
        "Зубр",
        "Соня-полчок"
      ]
    },
    "birds": {
      "predators": [
        "Орел-могильник",
        "Обыкновенная пустельга",
        "Чеглок",
        "Серая неясыть"
      ],
      "other": [
        "Соловей",
        "Белый аист",
        "Зяблик",
        "Иволга",
        "Серая цапля"
      ]
    }
  }
]

data2 = [
  {
    "region": "Западная Сибирь (тайга и болота)",
    "animals": {
      "predators": [
        "Бурый медведь",
        "Росомаха",
        "Рысь",
        "Соболь",
        "Колонок"
      ],
      "other": [
        "Лось",
        "Азиатский бурундук",
        "Заяц-беляк",
        "Лесной северный олень",
        "Водяная полевка"
      ]
    },
    "birds": {
      "predators": [
        "Филин",
        "Бородатая неясыть",
        "Дербник",
        "Чеглок"
      ],
      "other": [
        "Глухарь",
        "Рябчик",
        "Кедровка",
        "Шилохвость",
        "Серый журавль"
      ]
    }
  },
  {
    "region": "Восточная Сибирь (горная тайга)",
    "animals": {
      "predators": [
        "Бурый медведь",
        "Волк",
        "Соболь",
        "Росомаха",
        "Рысь"
      ],
      "other": [
        "Кабарга",
        "Изюбрь",
        "Снежный баран",
        "Северный олень",
        "Длиннохвостый суслик"
      ]
    },
    "birds": {
      "predators": [
        "Беркут",
        "Орлан-белохвост",
        "Сапсан",
        "Ястребиная сова"
      ],
      "other": [
        "Каменный глухарь",
        "Рябчик",
        "Кукша",
        "Черный журавль",
        "Сибирский дрозд"
      ]
    }
  },
  {
    "region": "Сибирская Арктика и тундра",
    "animals": {
      "predators": [
        "Белый медведь",
        "Песец",
        "Волк"
      ],
      "other": [
        "Дикий северный олень",
        "Овцебык",
        "Лемминг",
        "Заяц-беляк"
      ]
    },
    "birds": {
      "predators": [
        "Белая сова",
        "Кречет",
        "Сапсан",
        "Мохноногий канюк"
      ],
      "other": [
        "Белая куропатка",
        "Краснозобая казарка",
        "Стерх",
        "Тундровый лебедь",
        "Кулик-воробей"
      ]
    }
  },
  {
    "region": "Дальний Восток (Приморье и Приамурье)",
    "animals": {
      "predators": [
        "Амурский тигр",
        "Дальневосточный леопард",
        "Гималайский медведь",
        "Харза",
        "Енотовидная собака"
      ],
      "other": [
        "Пятнистый олень",
        "Изюбрь",
        "Горал",
        "Кабарга",
        "Маньчжурский заяц"
      ]
    },
    "birds": {
      "predators": [
        "Белоплечий орлан",
        "Рыбный филин",
        "Ястребиный сарыч",
        "Иглоногая сова"
      ],
      "other": [
        "Мандаринка",
        "Японский журавль",
        "Дикуша",
        "Даурский журавль",
        "Широкорот"
      ]
    }
  },
  {
    "region": "Дальний Восток (Камчатка и побережье)",
    "animals": {
      "predators": [
        "Камчатский бурый медведь",
        "Росомаха",
        "Лисица-сиводушка",
        "Калан",
        "Сивуч"
      ],
      "other": [
        "Снежный баран",
        "Северный олень",
        "Камчатский сурок",
        "Берингийский суслик"
      ]
    },
    "birds": {
      "predators": [
        "Белоплечий орлан",
        "Орлан-белохвост",
        "Кречет"
      ],
      "other": [
        "Топорок",
        "Ипатка",
        "Каменушка",
        "Тихоокеанская чайка"
      ]
    }
  },
  {
    "region": "Северный и Средний Урал (горная тайга)",
    "animals": {
      "predators": [
        "Бурый медведь",
        "Волк",
        "Рысь",
        "Лесная куница",
        "Росомаха"
      ],
      "other": [
        "Лось",
        "Северный олень",
        "Белка-летяга",
        "Бурундук",
        "Заяц-беляк"
      ]
    },
    "birds": {
      "predators": [
        "Беркут",
        "Длиннохвостая неясыть",
        "Мохноногий канюк"
      ],
      "other": [
        "Глухарь",
        "Рябчик",
        "Тетерев",
        "Трёхпалый дятел",
        "Кедровка"
      ]
    }
  },
  {
    "region": "Южный Урал (лесостепи и степи)",
    "animals": {
      "predators": [
        "Лисица",
        "Корсак",
        "Степной хорек",
        "Волк",
        "Барсук"
      ],
      "other": [
        "Косуля",
        "Кабан",
        "Сурка-байбак",
        "Большой тушканчик",
        "Хомяк обыкновенный"
      ]
    },
    "birds": {
      "predators": [
        "Степной орел",
        "Курганник",
        "Сплюшка",
        "Лунь степной"
      ],
      "other": [
        "Серая куропатка",
        "Дрофа",
        "Стрепет",
        "Журавль-красавка",
        "Золотистая щурка"
      ]
    }
  },
  {
    "region": "Европейская часть (лесная зона)",
    "animals": {
      "predators": [
        "Рысь",
        "Бурый медведь",
        "Волк",
        "Лесная куница",
        "Барсук"
      ],
      "other": [
        "Лось",
        "Европейский благородный олень",
        "Косуля",
        "Кабан",
        "Речной бобр"
      ]
    },
    "birds": {
      "predators": [
        "Осоед",
        "Серая неясыть",
        "Ястреб-перепелятник",
        "Орлан-белохвост"
      ],
      "other": [
        "Соловей",
        "Зяблик",
        "Иволга",
        "Черный дрозд",
        "Большой пестрый дятел"
      ]
    }
  },
  {
    "region": "Европейская часть (южные степи и полупустыни)",
    "animals": {
      "predators": [
        "Корсак",
        "Лисица",
        "Степной хорек",
        "Перевязка"
      ],
      "other": [
        "Сайгак",
        "Суслик малый",
        "Земляной заяц",
        "Заяц-русак"
      ]
    },
    "birds": {
      "predators": [
        "Орел-могильник",
        "Обыкновенная пустельга",
        "Степной лунь",
        "Балобан"
      ],
      "other": [
        "Дрофа",
        "Стрепет",
        "Журавль-красавка",
        "Розовый скворец",
        "Жаворонок степной"
      ]
    }
  }
]

# -------------------------- подготовка -------------------------

from collections import Counter
from pprint import pprint


def cprint(kv, wleft=20):
    for k, v in kv:
        print(f"{k:{wleft}} | {v}")

        
# -------------------------- расчёт -------------------------

data = data1

# ---------- тест 1 ----------

print('1. Собери всех хищных и посчитай')

pred = Counter()
for region in data:
    for animal in region['animals']['predators']:
        pred.update([animal])
    for animal in region['birds']['predators']:
        pred.update([animal])

pprint(pred)


# ~ 1. Собери всех хищных и посчитай
# ~ Counter({'Волк': 3,
         # ~ 'Бурый медведь': 2,
         # ~ 'Рысь': 2,
         # ~ 'Соболь': 1,
         # ~ 'Росомаха': 1,
         # ~ 'Филин': 1,
         # ~ 'Беркут': 1,
         # ~ 'Орлан-белохвост': 1,
         # ~ 'Бородатая неясыть': 1,
         # ~ 'Амурский тигр': 1,
         # ~ 'Дальневосточный леопард': 1,
         # ~ 'Гималайский медведь': 1,
         # ~ 'Харза': 1,
         # ~ 'Енотовидная собака': 1,
         # ~ 'Белоплечий орлан': 1,
         # ~ 'Рыбный филин': 1,
         # ~ 'Ястребиный сарыч': 1,
         # ~ 'Лесная куница': 1,
         # ~ 'Корсак': 1,
         # ~ 'Степной орел': 1,
         # ~ 'Мохноногий канюк': 1,
         # ~ 'Длиннохвостая неясыть': 1,
         # ~ 'Лисица': 1,
         # ~ 'Лесной хорек': 1,
         # ~ 'Ласка': 1,
         # ~ 'Барсук': 1,
         # ~ 'Орел-могильник': 1,
         # ~ 'Обыкновенная пустельга': 1,
         # ~ 'Чеглок': 1,
         # ~ 'Серая неясыть': 1})


# -------------------------- конец -------------------------
