rock_text = """
1972 пнв Аквариум
1978 пнв Пикник
1981 1991 Кино
1983 пнв Алиса
1980 пнв ДДТ
1985 пнв Ария
1983 пнв Браво
1982 1997 Наутилус Помпилиус
1985 пнв Чайф
1969 пнв Машина времени
1964 1969 Сокол
1964 1966 Славяне
1966 1979 Скоморохи
1962 1969 Интеграл
1961 пнв Удачное приобретение
1981 1991 Зоопарк
1985 пнв Бригада С
1978 пнв АукцЫон
1980 1991 Урфин Джюс
1979 пнв Воскресение
1979 1990 Автограф
1980 пнв Круиз
1969 1992 Диалог
1978 пнв Земляне
1977 1991 Магнетик бэнд
1983 1996 Секрет
1966 1984 Мифы
1969 пнв Санкт-Петербург
1984 пнв Телевизор
1985 пнв Ноль
1969 1990 Мозаика
1984 1991 Карнавал
1983 2021 Звуки Му
1988 пнв Ва-Банкъ
1983 пнв Крематорий
1980 пнв Центр
1983 пнв Несчастный случай
1984 пнв Коррозия металла
1988 пнв Ногу свело!
1995 пнв Умка и Броневик
1987 2010 Агата Кристи
1986 пнв Калинов мост
1984 2020 Гражданская оборона
1988 пнв Иван Кайф
1987 2000 Сектор Газа
1986 пнв Вопли Видоплясова
1979 пнв Чёрный Кофе
"""
