#!/python3.10

# Mikhail (myke) Kolodin, 2021
# 2021-11-26 2021-11-26 0.1
# shortlong.py



# ~ Человек и машина играют в слова так:
# ~ человек вводит строку,
# ~ а машина определяет,
# ~ какое слово в ней самое длинное
# ~ и какое слово в ней самое короткое
# ~ и сколько в них букв.
# ~ (если таких несколько, подойдёт любое).
# ~ Игра идёт по кругу, пока человек не введёт пустую строку или строку из одной точки.
# ~ После этого машина показывает самое длинное и самое короткое слова за всю игру (и сколько в них было букв).
# ~ (Подсказка. Длина строки определяется функцией len.)
