#!/usr/bin/env python
# Mikhail Kolodin, 2023
# 2023-02-08 2023-02-08 1.1
# ya-no-reps.py

# ~ Задача из яндекса.

# ~ Задача C. Удаление дубликатов
# ~ Дан упорядоченный по неубыванию массив целых 32-разрядных чисел. Требуется удалить из него все повторения.
# ~ Правильный алгоритм последовательно обрабатывает элементы массива, сравнивая их с последним выведенным. Нужно не забыть обновлять переменную, содержащую последний выведенный элемент и, кроме того, не ошибиться при обработке последнего элемента.
# ~ При решении этой задачи также не нужно использовать дополнительную память.

# ~ 1. генерация массива

from random import randint


def gen(length = 10):
    """массив указанной длины"""

    arr = [ randint(-100, 100) for _ in range(length)  ]
    arr.sort()

    # случайно меняем на дубликаты
    for i in range(len(arr)//3):
        arr[i*3] = arr[i*3+1]
    
    return arr

# ~ 2. решение


def solve(arr):
    """удалить повторения"""

    need = True

    while need:
        need = False
        if len(arr) < 2:
            break
        for i in range(1, len(arr)):
            if arr[i] == arr[i-1]:
                arr[i:] = arr[i+1:]
                need = True
                break


# ~ 3. запуск тестов

def run_tests(times = 10):
    """run times tests"""

    for test in range(times):
        arr = gen()
        print(arr)
        solve(arr)
        print(arr, '\n')


run_tests()

# ~ [-74, -74, -64, -26, -26, 3, 69, 69, 78, 78]
# ~ [-74, -64, -26, 3, 69, 78] 

# ~ [-17, -17, -8, 3, 3, 22, 36, 36, 66, 69]
# ~ [-17, -8, 3, 22, 36, 66, 69] 

# ~ [-87, -87, -77, -54, -54, -47, -31, -31, -19, 27]
# ~ [-87, -77, -54, -47, -31, -19, 27] 

# ~ [5, 5, 43, 56, 56, 79, 90, 90, 95, 97]
# ~ [5, 43, 56, 79, 90, 95, 97] 

# ~ [-91, -91, -26, 27, 27, 63, 83, 83, 96, 99]
# ~ [-91, -26, 27, 63, 83, 96, 99] 

# ~ [-73, -73, -60, 3, 3, 13, 61, 61, 82, 95]
# ~ [-73, -60, 3, 13, 61, 82, 95] 

# ~ [-46, -46, -39, 16, 16, 17, 33, 33, 64, 78]
# ~ [-46, -39, 16, 17, 33, 64, 78] 

# ~ [-75, -75, -74, -55, -55, -4, 44, 44, 73, 77]
# ~ [-75, -74, -55, -4, 44, 73, 77] 

# ~ [-35, -35, -9, 21, 21, 28, 34, 34, 56, 75]
# ~ [-35, -9, 21, 28, 34, 56, 75] 

# ~ [-60, -60, -46, 34, 34, 39, 66, 66, 73, 84]
# ~ [-60, -46, 34, 39, 66, 73, 84] 
