#!/usr/bin/env python

# Mikhail (myke) Kolodin, 2026
# langs-eu-borrow.py
# 2026-06-24 2026-06-24 1.0

# ~ Рассмотрим языки Европы, на каждом из которых говорит не менее 1 миллиона человек. Перечисли их, указав:
# ~ - name: название,
# ~ - lands: страны, где говорят на этом языке,
# ~ - words: количество слов в языке,
# ~ - borrow: процент заимствованных слов

# -------------------------- данные -------------------------

data = [
  {
    "name": "Английский язык",
    "lands": ["Великобритания", "Ирландия", "Мальта"],
    "words": 600000,
    "borrow": 75
  },
  {
    "name": "Немецкий язык",
    "lands": ["Германия", "Австрия", "Швейцария", "Люксембург", "Лихтенштейн", "Бельгия"],
    "words": 400000,
    "borrow": 25
  },
  {
    "name": "Французский язык",
    "lands": ["Франция", "Бельгия", "Швейцария", "Люксембург", "Монако"],
    "words": 150000,
    "borrow": 13
  },
  {
    "name": "Итальянский язык",
    "lands": ["Италия", "Швейцария", "Сан-Марино", "Ватикан"],
    "words": 270000,
    "borrow": 15
  },
  {
    "name": "Испанский язык",
    "lands": ["Испания"],
    "words": 100000,
    "borrow": 20
  },
  {
    "name": "Португальский язык",
    "lands": ["Португалия"],
    "words": 110000,
    "borrow": 15
  },
  {
    "name": "Русский язык",
    "lands": ["Россия", "Беларусь"],
    "words": 200000,
    "borrow": 10
  },
  {
    "name": "Украинский язык",
    "lands": ["Украина"],
    "words": 250000,
    "borrow": 15
  },
  {
    "name": "Польский язык",
    "lands": ["Польша"],
    "words": 140000,
    "borrow": 25
  },
  {
    "name": "Румынский язык",
    "lands": ["Румыния", "Молдова"],
    "words": 280000,
    "borrow": 40
  },
  {
    "name": "Нидерландский (голландский) язык",
    "lands": ["Нидерланды", "Бельгия"],
    "words": 350000,
    "borrow": 20
  },
  {
    "name": "Венгерский язык",
    "lands": ["Венгрия", "Румыния", "Словакия", "Сербия"],
    "words": 100000,
    "borrow": 30
  },
  {
    "name": "Чешский язык",
    "lands": ["Чехия"],
    "words": 250000,
    "borrow": 15
  },
  {
    "name": "Шведский язык",
    "lands": ["Швеция", "Финляндия"],
    "words": 126000,
    "borrow": 30
  },
  {
    "name": "Греческий язык",
    "lands": ["Греция", "Кипр"],
    "words": 150000,
    "borrow": 10
  },
  {
    "name": "Болгарский язык",
    "lands": ["Болгария"],
    "words": 120000,
    "borrow": 25
  },
  {
    "name": "Сербский язык",
    "lands": ["Сербия", "Босния и Герцеговина", "Черногория"],
    "words": 266000,
    "borrow": 20
  },
  {
    "name": "Хорватский язык",
    "lands": ["Хорватия", "Босния и Герцеговина"],
    "words": 120000,
    "borrow": 15
  },
  {
    "name": "Словацкий язык",
    "lands": ["Словакия"],
    "words": 130000,
    "borrow": 15
  },
  {
    "name": "Датский язык",
    "lands": ["Дания"],
    "words": 100000,
    "borrow": 35
  },
  {
    "name": "Финский язык",
    "lands": ["Финляндия"],
    "words": 150000,
    "borrow": 40
  },
  {
    "name": "Норвежский язык",
    "lands": ["Норвегия"],
    "words": 150000,
    "borrow": 35
  },
  {
    "name": "Каталанский язык",
    "lands": ["Испания", "Франция", "Андорра", "Италия"],
    "words": 100000,
    "borrow": 15
  },
  {
    "name": "Литовский язык",
    "lands": ["Литва"],
    "words": 120000,
    "borrow": 20
  },
  {
    "name": "Албанский язык",
    "lands": ["Албания", "Косово", "Северная Македония"],
    "words": 110000,
    "borrow": 60
  }
]

# -------------------------- подготовка -------------------------

from pprint import pprint

# -------------------------- расчёт -------------------------

# ---------- тест 1 ----------

print('1. покажи языки по оригинальности')

orig = [ (land['name'], land['borrow']) for land in data ]
orig.sort(key = lambda x: x[1])

pprint(orig)

# -------------------------- результаты -------------------------

# ~ 1. покажи языки по оригинальности
# ~ [('Русский язык', 10),
 # ~ ('Греческий язык', 10),
 # ~ ('Французский язык', 13),
 # ~ ('Итальянский язык', 15),
 # ~ ('Португальский язык', 15),
 # ~ ('Украинский язык', 15),
 # ~ ('Чешский язык', 15),
 # ~ ('Хорватский язык', 15),
 # ~ ('Словацкий язык', 15),
 # ~ ('Каталанский язык', 15),
 # ~ ('Испанский язык', 20),
 # ~ ('Нидерландский (голландский) язык', 20),
 # ~ ('Сербский язык', 20),
 # ~ ('Литовский язык', 20),
 # ~ ('Немецкий язык', 25),
 # ~ ('Польский язык', 25),
 # ~ ('Болгарский язык', 25),
 # ~ ('Венгерский язык', 30),
 # ~ ('Шведский язык', 30),
 # ~ ('Датский язык', 35),
 # ~ ('Норвежский язык', 35),
 # ~ ('Румынский язык', 40),
 # ~ ('Финский язык', 40),
 # ~ ('Албанский язык', 60),
 # ~ ('Английский язык', 75)]


# -------------------------- заметки -------------------------

# ~ Важные методологические примечанияПодсчет объема слов (words): Приведены консервативные оценки количества активных и зафиксированных лексем в авторитетных академических словарях (без учета бесконечных узкоспециализированных медицинских и химических терминов). Например, для английского языка взят объем полного Оксфордского словаря (OED), для русского — Большого академического словаря.Процент заимствований (borrow): Отражает долю некоренных слов в общем лексическом составе. В английском языке аномальные 75% объясняются массивным вливанием французских и латинских корней после нормандского завоевания. В румынском, албанском и финском языках высокий процент связан со сложным историческим соседством и замещением древних пластов лексики славянскими, романскими или германскими корнями.

# -------------------------- конец -------------------------
