#!/usr/bin/env python

# Mikhail (myke) Kolodin, 2026
# often-names.py
# 2026-07-14 2026-07-14 1.0

# ~ по 10 ведущим странам Европы и Америки перечисли по 20 наиболее распространённых имён (отдельно 10 мужских (men) и 10 женских (women)); формат list[dict], ключи англ., значения в переводе на русский

names = [
    {
        "country": "США",
        "men": ["Лиам", "Ноа", "Оливер", "Джеймс", "Уильям", "Бенджамин", "Лукас", "Генри", "Теодор", "Джек"],
        "women": ["Оливия", "Эмма", "Шарлотта", "Амелия", "София", "Миа", "Изабелла", "Эвелин", "Харпер", "Луна"]
    },
    {
        "country": "Германия",
        "men": ["Ноа", "Маттео", "Леон", "Финн", "Элиас", "Пауль", "Лука", "Луис", "Феликс", "Генри"],
        "women": ["Эмилия", "Миа", "София", "Эмма", "Ханна", "Лина", "Мила", "Элла", "Клара", "Мари"]
    },
    {
        "country": "Великобритания",
        "men": ["Ноа", "Оливер", "Джордж", "Лео", "Артур", "Мухаммад", "Оскар", "Гарри", "Арчи", "Тео"],
        "women": ["Оливия", "Амелия", "Исла", "Лили", "Ава", "Фрейя", "Айви", "София", "Грейс", "Иви"]
    },
    {
        "country": "Франция",
        "men": ["Габриэль", "Лео", "Рафаэль", "Луи", "Маэль", "Артур", "Хьюго", "Жюль", "Лиам", "Ноа"],
        "women": ["Жад", "Луиза", "Амбра", "Альба", "Эмма", "Роза", "Алиса", "Анна", "Лина", "Миа"]
    },
    {
        "country": "Италия",
        "men": ["Леонардо", "Франческо", "Томмазо", "Эдоардо", "Алессандро", "Лоренцо", "Маттиа", "Габриэле", "Риккардо", "Томмазо"],
        "women": ["София", "Аврора", "Джулия", "Джиневра", "Аличе", "Беатриче", "Эмма", "Джорджия", "Виттория", "Матильда"]
    },
    {
        "country": "Бразилия",
        "men": ["Мигель", "Артур", "Гаэль", "Тео", "Эйтор", "Рави", "Самуэль", "Бернардо", "Ноа", "Габриэль"],
        "women": ["Хелена", "Алиса", "Лаура", "Мария Элис", "Валентина", "Элоа", "Мария Клара", "Мария Сесилия", "Мария Джулия", "София"]
    },
    {
        "country": "Мексика",
        "men": ["Сантьяго", "Матео", "Себастьян", "Леонардо", "Матиас", "Эмилиано", "Диего", "Даниэль", "Александр", "Мигель"],
        "women": ["София", "Валентина", "Регина", "Мария Хосе", "Химена", "Камила", "Мария Фернанда", "Виктория", "Изабелла", "Даниэла"]
    },
    {
        "country": "Испания",
        "men": ["Мартин", "Уго", "Матео", "Лео", "Лукас", "Мануэль", "Алехандро", "Пабло", "Даниэль", "Альваро"],
        "women": ["Люсия", "София", "Мартина", "Валерия", "Мария", "Джулия", "Паула", "Эмма", "Даниэла", "Альба"]
    },
    {
        "country": "Канада",
        "men": ["Ноа", "Лиам", "Оливер", "Тео", "Джек", "Лукас", "Бенджамин", "Лео", "Итан", "Уильям"],
        "women": ["Оливия", "Эмма", "Шарлотта", "Амелия", "София", "Хлоя", "Миа", "Мила", "Исла", "Алиса"]
    },
    {
        "country": "Аргентина",
        "men": ["Матео", "Фелипе", "Бенхамин", "Энцо", "Бруно", "Сантьяго", "Хоакин", "Баутиста", "Лиам", "Валентино"],
        "women": ["Эмма", "Оливия", "Мартина", "Изабелла", "Каталина", "София", "Миа", "Хуана", "Франческа", "Альфонсина"]
    }
]

# -------------------------------------------------------------

print("\n1. сколько всего стран?")

print( len(names) )

# -------------------------------------------------------------

print("\n2. сколько всего имён?")

nn = set()
for land in names:
    nn |= set(land['men'])
    nn |= set(land['women'])

print( len(nn) )

# -------------------------------------------------------------

print("\n3. какие мужское и женское имена самые частые?")

from collections import Counter
omen = Counter()
owomen = Counter()

for land in names:
    omen.update( land['men'] )
    owomen.update( land['women'] )

mm = omen.most_common(1)[0]
mw = owomen.most_common(1)[0]

print(f"""
самое частое мужское: {mm[0]}: {mm[1]} раз(а)
самое частое женское: {mw[0]}: {mw[1]} раз(а)
""")

# -------------------------------------------------------------
print()


# ~ 1. сколько всего стран?
# ~ 10

# ~ 2. сколько всего имён?
# ~ 133

# ~ 3. какие мужское и женское имена самые частые?

# ~ самое частое мужское: Ноа: 6 раз(а)
# ~ самое частое женское: София: 9 раз(а)
