#!/usr/bin/env python

# Mikhail (myke) Kolodin, 2022
# 2024-10-30 2024-10-30 1.1
# sequences.py

# ~ работа с пследовательностями

import random
from pprint import pp
import copy

# ============================================================================
# 0. Создание и печать матрицы
# ============================================================================

def make1dim(elems=3, bottom=0, top=9):
    """создать вектор"""
    
    return [ random.randint(bottom, top) for c in range(elems) ] 

    
def make2dim(rows=3, cols=3, bottom=0, top=9):
    """создать матрицу"""
    
    return [ [ random.randint(bottom, top) for c in range(cols) ] for r in range(rows) ]

    
def mprint(a, width=4):
    """напечатать матрицу"""
    
    for i in range(len(a)):
        for j in range(len(a[i])):
            print(f"%{width}d" % a[i][j], end="")
        print()


# ============================================================================
# 1. проверка и правка
# ============================================================================

# ~ 1.1. Сглаживание.
# ~ В некоторой заданной натуральной последовательности 
# ~ заменить элементы на среднее арифм. их соседей.
# ~ (Не считать для крайних элементов).

def deltas(seq, proc=50):
    """подсчёт и правка"""

    a = seq[:]
    for i in range(1, len(seq)-1):
        neibmed = (seq[i-1] + seq[i+1]) / 2
        a[i] = int(neibmed + .5)

    return a


def deltas_test(times=10, rept=1):
    """запуск тестов"""

    for raz in range(1, times+1):
        a = make1dim(10, 80, 90)
        for i in range(1, len(a)):
            if random.random() > .9:
                a[i] *= 2
        print("\nбыло: ", 0, a)
        for rep in range(1, rept+1):
            b = deltas(a)
            print("стало:", rep, b)
            a = b[:]

deltas_test(times=1, rept=5)

# ~ было:  [81, 85, 90, 400, 82, 83, 83, 400, 83, 89]
# ~ стало: [81, 86, 243, 86, 242, 83, 242, 83, 245, 89]

# ~ было:  0 [84, 89, 82, 87, 89, 89, 90, 166, 90, 90]
# ~ стало: 1 [84, 83, 88, 86, 88, 90, 128, 90, 128, 90]
# ~ стало: 2 [84, 86, 85, 88, 88, 108, 90, 128, 90, 90]
# ~ стало: 3 [84, 85, 87, 87, 98, 89, 118, 90, 109, 90]
# ~ стало: 4 [84, 86, 86, 93, 88, 108, 90, 114, 90, 90]
# ~ стало: 5 [84, 85, 90, 87, 101, 89, 111, 90, 102, 90]

# ============================================================================
