#!/usr/bin/env python

# Mikhail (myke) Kolodin, 2022
# 2024-11-04 2024-11-04 1.0
# ack-pairs.py

# ~ Даны пары ребят, которые дружат друг с другом.
# ~ Но указаны не все пары.
# ~ А дружба - симметрична и транзитивна.
# ~ Определить, все ли ребята дружат между собой.

import random

def prepare():
    school = "Аня Боря Вася Гена Денис Ева Женя Ира Катя Лена Маша Нюша Оля Петя Рита Света Тёма Уля Филя Эдик Юля Яна" . split()

    amik = []

    for _ in range(len(school) * 2):
        a = random.choice(school)
        b = random.choice(school)
        if a != b:
            amik.append((a, b))
    
    return school, amik
    

def solve(school, amik):

    school.sort()
    amik.sort()
    good = []

    for para in amik:
        good.append(para[0])
        good.append(para[1])

    good = sorted(set(good))

    return school == good
    

def main():
    school, amik = prepare()
    print("Дано: школа:", school, "\nдрузья:", amik)
    res  = solve(school, amik)
    print("Все друзья:", "да" if res else "нет")

main()
 

# ~ Дано: школа: ['Аня', 'Боря', 'Вася', 'Гена', 'Денис', 'Ева', 'Женя', 'Ира', 'Катя', 'Лена', 'Маша', 'Нюша', 'Оля', 'Петя', 'Рита', 'Света', 'Тёма', 'Уля', 'Филя', 'Эдик', 'Юля', 'Яна'] 
# ~ друзья: [('Оля', 'Денис'), ('Петя', 'Лена'), ('Катя', 'Боря'), ('Эдик', 'Юля'), ('Катя', 'Денис'), ('Филя', 'Тёма'), ('Филя', 'Женя'), ('Гена', 'Лена'), ('Рита', 'Петя'), ('Юля', 'Петя'), ('Маша', 'Ира'), ('Эдик', 'Света'), ('Ева', 'Филя'), ('Катя', 'Ира'), ('Нюша', 'Денис'), ('Уля', 'Денис'), ('Уля', 'Денис'), ('Маша', 'Тёма'), ('Маша', 'Аня'), ('Эдик', 'Рита'), ('Гена', 'Ира'), ('Боря', 'Нюша'), ('Юля', 'Света'), ('Уля', 'Лена'), ('Лена', 'Эдик'), ('Оля', 'Рита'), ('Аня', 'Катя'), ('Тёма', 'Женя'), ('Оля', 'Уля'), ('Света', 'Оля'), ('Юля', 'Лена'), ('Эдик', 'Петя'), ('Уля', 'Света'), ('Юля', 'Вася'), ('Маша', 'Филя'), ('Аня', 'Лена'), ('Эдик', 'Катя'), ('Гена', 'Света'), ('Яна', 'Аня'), ('Нюша', 'Боря'), ('Тёма', 'Филя'), ('Ира', 'Лена'), ('Лена', 'Маша')]
# ~ Все друзья: да

# ~ Дано: школа: ['Аня', 'Боря', 'Вася', 'Гена', 'Денис', 'Ева', 'Женя', 'Ира', 'Катя', 'Лена', 'Маша', 'Нюша', 'Оля', 'Петя', 'Рита', 'Света', 'Тёма', 'Уля', 'Филя', 'Эдик', 'Юля', 'Яна'] 
# ~ друзья: [('Уля', 'Женя'), ('Света', 'Ира'), ('Боря', 'Денис'), ('Ира', 'Гена'), ('Петя', 'Эдик'), ('Маша', 'Оля'), ('Гена', 'Нюша'), ('Аня', 'Света'), ('Вася', 'Тёма'), ('Тёма', 'Лена'), ('Тёма', 'Эдик'), ('Гена', 'Тёма'), ('Боря', 'Тёма'), ('Тёма', 'Катя'), ('Гена', 'Уля'), ('Аня', 'Яна'), ('Лена', 'Петя'), ('Нюша', 'Филя'), ('Тёма', 'Маша'), ('Уля', 'Женя'), ('Женя', 'Денис'), ('Оля', 'Женя'), ('Яна', 'Вася'), ('Эдик', 'Боря'), ('Аня', 'Уля'), ('Катя', 'Боря'), ('Оля', 'Юля'), ('Ира', 'Лена'), ('Женя', 'Рита'), ('Оля', 'Юля'), ('Катя', 'Эдик'), ('Лена', 'Катя'), ('Эдик', 'Женя'), ('Женя', 'Катя'), ('Ира', 'Аня'), ('Катя', 'Женя'), ('Яна', 'Рита'), ('Рита', 'Боря'), ('Маша', 'Лена')]
# ~ Все друзья: нет
