#!/usr/bin/env python
# Mikhail (myke) Kolodin 2022-05-06 2022-05-06 1.0
# dict-rock-data.py

# ~ Есть некоторые сведения о русском роке.
# ~ Найти разную полезную информацию.

coj = [
{
"year": 1982,
"name": "45",
"songs": [
"Время есть, а денег нет",
"Просто хочешь ты знать",
"Алюминиевые огурцы",
"Солнечные дни",
"Бездельник",
"Бездельник 2",
"Электричка",
"Восьмиклассница",
"Мои друзья",
"Ситар играл",
"Дерево",
"Когда-то ты был битником",
"На кухне",
"Я — асфальт"
]
},

{
"year": 1983,
"name": "46",
"songs": [
"Троллейбус",
"Камчатка",
"Транквилизатор",
"Я иду по улице",
"Дождь для нас",
"Пора",
"Каждую ночь",
"Без десяти",
"Музыка волн",
"Саша",
"Хочу быть с тобой",
"Генерал",
"Стань птицей",
"Сельва",
"Я хочу быть кочегаром"
]
},

{
"year": 1984,
"name": "Начальник Камчатки",
"songs": [
"Последний герой",
"Каждую ночь",
"Транквилизатор",
"Сюжет для новой песни",
"Гость",
"Камчатка",
"Ария мистера Х",
"Троллейбус",
"Растопите снег",
"Дождь для нас",
"Хочу быть с тобой",
"Генерал",
"Прогулка романтика",
"Танкисты",
"Анаша",
"Постой, паровоз"
]
},

{
"year": 1985,
"name": "Это не любовь",
"songs": [
"Это не любовь",
"Весна",
"Уходи",
"Город",
"Проснись",
"Ты выглядишь так несовременно",
"Безъядерная зона",
"Саша",
"Верь мне",
"Дети проходных дворов",
"Музыка волн",
"Разреши мне",
"Стишок",
"Прохожий"
]
},

{
"year": 1986,
"name": "Ночь",
"songs": [
"Видели ночь",
"Фильмы",
"Твой номер",
"Танец",
"Ночь",
"Последний герой",
"Жизнь в стёклах",
"Мама-анархия",
"Звёзды останутся здесь",
"Игра",
"Мы хотим танцевать"
]
},

{
"year": 1988,
"name": "Группа крови",
"songs": [
"Группа крови",
"Закрой за мной дверь, я ухожу",
"Война",
"Спокойная ночь",
"Мама, мы все сошли с ума",
"Бошетунмай",
"В наших глазах",
"Попробуй спеть вместе со мной",
"Прохожий",
"Дальше действовать будем мы",
"Легенда"
]
},

{
"year": 1989,
"name": "Звезда по имени Солнце",
"songs": [
"Песня без слов",
"Звезда по имени Солнце",
"Невесёлая песня",
"Сказка",
"Место для шага вперед",
"Пачка сигарет",
"Стук",
"Печаль",
"Апрель"
]
},

{
"year": 1989,
"name": "Последний герой",
"songs": [
"Хочу перемен",
"Электричка",
"Война",
"Троллейбус",
"Печаль",
"Последний герой",
"Группа крови",
"Мама, мы все тяжело больны",
"В наших глазах",
"Спокойная ночь"
]
},

{
"year": 1991,
"name": "Кино (без названия, 'Чёрный альбом')",
"songs": [
"Кончится лето",
"Красно-жёлтые дни",
"Нам с тобой",
"Звезда",
"Кукушка",
"Когда твоя девушка больна",
"Муравейник",
"Следи за собой",
"Сосны на морском берегу",
"Завтра война"
]
}
]
