#!/usr/bin/env python

# Mikhail (myke) Kolodin, 2026
# nuclear.py
# 2026-06-24 2026-06-24 1.0

# ~ какие страны располагают ядерным оружием, каким, сколько, какой процент человечества может быть уничтожен или существенно повреждён максимально (поле destruct)? ответ в list[json]

# -------------------------- данные -------------------------

data = [
  {
    "country": "Россия",
    "total_inventory": 5459,
    "military_stockpile": 4380,
    "types": ["МБР", "БРПЛ", "Стратегическая авиация (Ядерная триада)", "Тактическое ядерное оружие"],
    "destruct": "60-80%"
  },
  {
    "country": "США",
    "total_inventory": 5177,
    "military_stockpile": 3700,
    "types": ["МБР", "БРПЛ", "Стратегическая авиация (Ядерная триада)", "Тактическое ядерное оружие"],
    "destruct": "60-80%"
  },
  {
    "country": "Китай",
    "total_inventory": 600,
    "military_stockpile": 600,
    "types": ["МБР", "БРПЛ", "Стратегические бомбардировщики"],
    "destruct": "20-40%"
  },
  {
    "country": "Франция",
    "total_inventory": 290,
    "military_stockpile": 290,
    "types": ["БРПЛ (подводные лодки класса Триумфан)", "Крылатые ракеты воздушного базирования ASMPA"],
    "destruct": "5-15%"
  },
  {
    "country": "Великобритания",
    "total_inventory": 225,
    "military_stockpile": 225,
    "types": ["БРПЛ Trident II на ПЛАРБ класса Вэнгард"],
    "destruct": "5-15%"
  },
  {
    "country": "Индия",
    "total_inventory": 180,
    "military_stockpile": 180,
    "types": ["Баллистические ракеты наземного базирования (Агни)", "БРПЛ (К-15/К-4)", "Тактическая авиация Mirage 2000/Jaguar"],
    "destruct": "10-25%"
  },
  {
    "country": "Пакистан",
    "total_inventory": 170,
    "military_stockpile": 170,
    "types": ["Баллистические ракеты (Шахин, Гаури)", "Крылатые ракеты (Бабур)", "Истребители F-16/JF-17"],
    "destruct": "10-25%"
  },
  {
    "country": "Израиль",
    "total_inventory": 90,
    "military_stockpile": 90,
    "types": ["Баллистические ракеты Иерихон-3", "Крылатые ракеты на подводных лодках Dolphin", "Самолеты F-15I/F-16I"],
    "destruct": "1-5%"
  },
  {
    "country": "КНДР",
    "total_inventory": 50,
    "military_stockpile": 50,
    "types": ["Баллистические ракеты малой, средней и межконтинентальной дальности (Хвасон)"],
    "destruct": "1-3%"
  }
]

# -------------------------- подготовка -------------------------

from pprint import pprint

# -------------------------- расчёт -------------------------

# ---------- тест 1 ----------

print("1. перечисли страны по алфавиту и их суммарный заряд")

stock = { land['country'] : land['total_inventory'] + land['military_stockpile']
        for land in data }

report = [ (k, v) for k, v in stock.items() ]

report.sort()

pprint(report)

# ---------- тест 2 ----------

print("2. перечисли страны по убыванию их суммарного заряда")

report.sort(key = lambda x: x[1], reverse=True)

pprint(report)

# -------------------------- результаты -------------------------

# ~ 1. перечисли страны по алфавиту и их суммарный заряд
# ~ [('Великобритания', 450),
 # ~ ('Израиль', 180),
 # ~ ('Индия', 360),
 # ~ ('КНДР', 100),
 # ~ ('Китай', 1200),
 # ~ ('Пакистан', 340),
 # ~ ('Россия', 9839),
 # ~ ('США', 8877),
 # ~ ('Франция', 580)]

# ~ 2. перечисли страны по убыванию их суммарного заряда
# ~ [('Россия', 9839),
 # ~ ('США', 8877),
 # ~ ('Китай', 1200),
 # ~ ('Франция', 580),
 # ~ ('Великобритания', 450),
 # ~ ('Индия', 360),
 # ~ ('Пакистан', 340),
 # ~ ('Израиль', 180),
 # ~ ('КНДР', 100)]

# -------------------------- конец -------------------------
