ddt = [
{
'Альбом': 'Я получил эту роль',
'Релиз': '1989',
'Лейбл': 'Мелодия, DDT, Квадро-Диск, KDK, Grand, Астра',
'Формат': 'LP (1989/1990/1991), CS (1994/1999/2001), CD (1994/1999/2001)'
},
{
'Альбом': 'Оттепель',
'Релиз': 'ноябрь 1991',
'Лейбл': 'SNC, Квадро-Диск, СНС, Grand',
'Формат': 'LP (1991), CS (1993/2001), CD (1993/1999/2001)'
},
{
'Альбом': 'Актриса Весна',
'Релиз': 'ноябрь 1992',
'Лейбл': 'DDT, Квадро-Диск, Grand, Navigator, Бомба-Питер',
'Формат': 'LP (1992/2012), CS (1992), CD (1993/1996/1999/2001/2011)'
},
{
'Альбом': 'Это всё...',
'Релиз': '1995',
'Лейбл': 'DDT, Квадро-Диск, Grand, Navigator, Imagine Club',
'Формат': 'LP (2016), CS (1995/2001), CD (1995/1999/2001/2011)'
},
{
'Альбом': 'Пластун',
'Релиз': '1995',
'Лейбл': 'DDT, Квадро-Диск, KDK, Grand',
'Формат': 'CS (1995/2001), CD (1995/1999/2001)'
},
{
'Альбом': 'Любовь',
'Релиз': '23 ноября 1996',
'Лейбл': 'DDT, Квадро-Диск, Grand, Астра, Navigator',
'Формат': 'CS (1996/2001), CD (1996/1999/2001/2011)'
},
{
'Альбом': 'Мир номер ноль',
'Релиз': '25 марта 1999',
'Лейбл': 'REAL, Grand, Navigator, Бомба-Питер',
'Формат': 'LP (2012), CS (1999/2001), CD (1999/2001/2011)'
},
{
'Альбом': 'Метель августа',
'Релиз': 'февраль 2000',
'Лейбл': 'Монолит, Grand, СНС, Navigator',
'Формат': 'CS (2000/2001), CD (2000/2001/2011)'
},
{
'Альбом': 'Единочество',
'Релиз': '26 ноября 2002, 27 мая 2003',
'Лейбл': 'REAL, Navigator',
'Формат': 'CS (2002-2003), CD (2002-2003/2014)'
},
{
'Альбом': 'Пропавший без вести',
'Релиз': '23 апреля 2005',
'Лейбл': 'CD Land, Moon, Navigator',
'Формат': 'CS (2005), CD (2005/2014)'
},
{
'Альбом': 'Прекрасная любовь',
'Релиз': '19 апреля 2007',
'Лейбл': 'Navigator, Moon',
'Формат': 'CD (2007)'
},
{
'Альбом': 'Иначе',
'Релиз': '25 октября 2011',
'Лейбл': 'Navigator, Астра, Imagine Club',
'Формат': 'LP (2015), CD (2011)'
},
{
'Альбом': 'Прозрачный',
'Релиз': '16 мая 2014',
'Лейбл': 'Navigator, Астра, Imagine Club',
'Формат': 'LP (2017), CD (2014)'
},
{
'Альбом': 'Галя ходи',
'Релиз': '9 июня 2018',
'Лейбл': 'Navigator',
'Формат': 'CD (2018), LP (2021)'
},
{
'Альбом': 'Творчество в пустоте',
'Релиз': '28 октября 2021',
'Лейбл': 'Navigator',
'Формат': 'CD (2021), LP (2021), CS (2021)'
}
]
